{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. **STEP 1: COMBINE THE COHORT PRIOR TO DISCRETIZATION**
. 
. **NHANES**
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET",clear
{txt}
{com}. 
. 
. 
. keep seqn COHORT _st _d _t _t0 TIMEyears DIED sample_final invmillsfin AGE HorvathAgeEAA_no_outliers HannumAgeEAA_no_outliers PhenoAgeEAA_no_outliers GrimAgeMortEAA_no_outliers DunedinPoAm_no_outliers zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm telomean_no_outliers ztelomean_no_outliers RACE SEX AGE WTDN4YR sdmvpsu sdmvstra
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_SMALL",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_SMALL.dta{rm}
saved
{p_end}

{com}. 
. 
. capture drop ID
{txt}
{com}. gen ID=seqn
{txt}
{com}. 
. capture drop seqn 
{txt}
{com}. 
. tab SEX

        {txt}SEX {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     10,214       48.63       48.63
{txt}          2 {c |}{res}     10,790       51.37      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     21,004      100.00
{txt}
{com}. 
. replace SEX=0 if SEX==1
{txt}(10,214 real changes made)

{com}. replace SEX=1 if SEX==2
{txt}(10,790 real changes made)

{com}. 
. 
. capture rename WTDN4YR sampling_weight
{txt}
{com}. capture rename sdmvpsu PSU
{txt}
{com}. capture rename sdmvstra STRATUM
{txt}
{com}. 
. tab RACE 

       {txt}RACE {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,973       37.96       37.96
{txt}          1 {c |}{res}      4,909       23.37       61.33
{txt}          2 {c |}{res}      7,275       34.64       95.97
{txt}          3 {c |}{res}        847        4.03      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     21,004      100.00
{txt}
{com}. 
. 
. svyset PSU [pweight=sampling_weight], strata(STRATUM) vce(linearized) singleunit(missing)

{txt}Sampling weights:{col 19}{res}sampling_weight
             {txt}VCE:{col 19}{res}linearized
     {txt}Single unit:{col 19}{res}missing
        {txt}Strata 1:{col 19}{res}STRATUM
 {txt}Sampling unit 1:{col 19}{res}PSU
           {txt}FPC 1:{col 19}<zero>
{p2colreset}{...}

{com}. 
. 
. stset TIMEyears [pweight=sampling_weight], id(ID) failure(DIED==1)

{txt}Survival-time data settings

{col 12}ID variable: {res}ID
{col 10}{txt}Failure event: {res}DIED==1
{col 1}{txt}Observed time interval: {res}(TIMEyears[_n-1], TIMEyears]
{col 6}{txt}Exit on or before: {res}failure
{col 17}{txt}Weight: {res}[pweight=sampling_weight]

{txt}{hline 74}
{res}     21,004{txt}  total observations
{res}     10,445{txt}  event time missing (TIMEyears>=.){col 61}PROBABLE ERROR
{res}          1{txt}  observation ends on or before {bf:enter()}
{res}      8,026{txt}  weights invalid {col 61}PROBABLE ERROR
{hline 74}
{res}      2,532{txt}  observations remaining, representing
{res}      2,532{txt}  subjects
{res}      1,361{txt}  failures in single-failure-per-subject data
{res} 35,399.583{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res}        0
                                          {txt}Last observed exit t = {res}    20.75
{txt}
{com}. 
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_SMALLfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_SMALLfin.dta{rm}
saved
{p_end}

{com}. 
. 
. **HRS**
. 
. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT",clear
{txt}
{com}. 
. capture drop COHORT
{txt}
{com}. gen COHORT=2
{txt}
{com}. 
. 
. keep HHIDPN _st _d _t _t0 COHORT sample_final AGE SEX RACE_ETHN invmillsfin time_event ageenter ageevent doexit died zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm ztelomean_no_outliers HORVATH_DNAMAGE_no_outliersEAA HANNUM_DNAMAGE_no_outliersEAA LEVINE_DNAMAGE_no_outliersEAA DNAMGRIMAGE_no_outliersEAA MPOA_no_outliers HORVATH_DNAMAGE_no_outliers HANNUM_DNAMAGE_no_outliers LEVINE_DNAMAGE_no_outliers DNAMGRIMAGE_no_outliers MPOA_no_outliers vbsi16wgtra FINAL_T_S_no_outliers stratum secu
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT_SMALL",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT_SMALL.dta{rm}
saved
{p_end}

{com}. 
. capture drop ID
{txt}
{com}. gen ID=HHIDPN
{txt}
{com}. 
. capture drop telomean_no_outliers
{txt}
{com}. gen telomean_no_outliers=FINAL_T_S_no_outliers
{txt}(41,118 missing values generated)

{com}. 
. capture  FINAL_T_S_no_outliers
{txt}
{com}. 
. histogram telomean_no_outliers
{txt}(bin={res}37{txt}, start={res}.19988681{txt}, width={res}.07510688{txt})
{res}{txt}
{com}. su telomean_no_outliers

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
telomean_n~s {c |}{res}      5,733    1.324211    .3341729   .1998868   2.978842
{txt}
{com}. 
. capture rename died DIED
{txt}
{com}. 
. capture rename HORVATH_DNAMAGE_no_outliersEAA HorvathAgeEAA_no_outliers
{txt}
{com}. capture rename HANNUM_DNAMAGE_no_outliersEAA HannumAgeEAA_no_outliers
{txt}
{com}. capture rename LEVINE_DNAMAGE_no_outliersEAA PhenoAgeEAA_no_outliers
{txt}
{com}. capture rename DNAMGRIMAGE_no_outliersEAA GrimAgeMortEAA_no_outliers
{txt}
{com}. capture rename MPOA_no_outliers DunedinPoAm_no_outliers
{txt}
{com}. 
. capture drop HORVATH_DNAMAGE_no_outliers DNAMGRIMAGE_no_outliers HANNUM_DNAMAGE_no_outliers LEVINE_DNAMAGE_no_outliers
{txt}
{com}. 
. capture rename secu PSU
{txt}
{com}. capture rename stratum STRATUM
{txt}
{com}. 
. 
. capture drop ageenter ageevent doexit 
{txt}
{com}. 
. capture rename time_event TIMEyears
{txt}
{com}. 
. 
. capture rename vbsi16wgtra sampling_weight
{txt}
{com}. 
. capture drop HHIDPN
{txt}
{com}.  
. tab RACE_ETHN

  {txt}RACE_ETHN {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     27,571       65.15       65.15
{txt}          2 {c |}{res}      7,923       18.72       83.87
{txt}          3 {c |}{res}      5,254       12.42       96.29
{txt}          4 {c |}{res}      1,571        3.71      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     42,319      100.00
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT_SMALL",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT_SMALL.dta{rm}
saved
{p_end}

{com}. 
. 
. gen RACE=.
{txt}(46,851 missing values generated)

{com}. replace RACE=0 if RACE_ETHN==1
{txt}(27,571 real changes made)

{com}. replace RACE=1 if RACE_ETHN==2
{txt}(7,923 real changes made)

{com}. replace RACE=2 if RACE_ETHN==3
{txt}(5,254 real changes made)

{com}. replace RACE=3 if RACE_ETHN==4
{txt}(1,571 real changes made)

{com}. 
. 
. tab RACE

       {txt}RACE {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     27,571       65.15       65.15
{txt}          1 {c |}{res}      7,923       18.72       83.87
{txt}          2 {c |}{res}      5,254       12.42       96.29
{txt}          3 {c |}{res}      1,571        3.71      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     42,319      100.00
{txt}
{com}. 
. 
. 
. svyset PSU [pweight=sampling_weight], strata(STRATUM) vce(linearized) singleunit(missing)

{txt}Sampling weights:{col 19}{res}sampling_weight
             {txt}VCE:{col 19}{res}linearized
     {txt}Single unit:{col 19}{res}missing
        {txt}Strata 1:{col 19}{res}STRATUM
 {txt}Sampling unit 1:{col 19}{res}PSU
           {txt}FPC 1:{col 19}<zero>
{p2colreset}{...}

{com}. 
. 
. stset TIMEyears [pweight=sampling_weight], id(ID) failure(DIED==1)

{txt}Survival-time data settings

{col 12}ID variable: {res}ID
{col 10}{txt}Failure event: {res}DIED==1
{col 1}{txt}Observed time interval: {res}(TIMEyears[_n-1], TIMEyears]
{col 6}{txt}Exit on or before: {res}failure
{col 17}{txt}Weight: {res}[pweight=sampling_weight]

{txt}{hline 74}
{res}     46,851{txt}  total observations
{res}     45,823{txt}  event time missing (TIMEyears>=.){col 61}PROBABLE ERROR
{hline 74}
{res}      1,028{txt}  observations remaining, representing
{res}      1,028{txt}  subjects
{res}        274{txt}  failures in single-failure-per-subject data
{res}  6,193.964{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res}        0
                                          {txt}Last observed exit t = {res} 7.581398
{txt}
{com}. 
. 
.  
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT_SMALLfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT_SMALLfin.dta{rm}
saved
{p_end}

{com}. 
. 
. **HANDLS**
. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",clear
{txt}
{com}. 
. 
. keep HNDID SEX Age RACE tLength DunedinPACE DNAmAge_Horvath DNAmAge_Hannum dead ageout HorvathAge HannumAge DunedinPoAm HorvathAgeEAA HannumAgeEAA HorvathAgeEAA_no_outliers HannumAgeEAA_no_outliers DunedinPoAm_no_outliers zHorvathAgeEAA zHannumAgeEAA zDunedinPoAm telomean_no_outliers ztelomean_no_outliers COHORT Age_follow DIED TIMEyears _st _d _t _t0 sample_final invmillsfin exam_base_wt
{txt}
{com}. 
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin_SMALL",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin_SMALL.dta{rm}
saved
{p_end}

{com}. 
. 
. capture drop ID
{txt}
{com}. gen ID=HNDID
{txt}
{com}. 
. capture drop HNDID
{txt}
{com}. 
. capture drop tLength
{txt}
{com}. 
. capture drop Age_follow
{txt}
{com}. 
. capture drop dead
{txt}
{com}. 
. capture drop ageout
{txt}
{com}. 
. capture rename Age AGE
{txt}
{com}. 
. capture drop DunedinPACE DNAmAge_Horvath DNAmAge_Hannum dead ageout HorvathAge HannumAge DunedinPoAm
{txt}
{com}. 
. tab RACE

       {txt}RACE {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,522       40.91       40.91
{txt}          1 {c |}{res}      2,198       59.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. capture rename exam_base_wt sampling_weight
{txt}
{com}. 
. 
. 
. svyset [pweight=sampling_weight], vce(linearized) singleunit(missing)

{txt}Sampling weights:{col 19}{res}sampling_weight
             {txt}VCE:{col 19}{res}linearized
     {txt}Single unit:{col 19}{res}missing
        {txt}Strata 1:{col 19}<one>
 Sampling unit 1:{col 19}<observations>
           FPC 1:{col 19}<zero>
{p2colreset}{...}

{com}. 
. 
. stset TIMEyears [pweight=sampling_weight], failure(DIED==1)

{txt}Survival-time data settings

{col 10}Failure event: {res}DIED==1
{col 1}{txt}Observed time interval: {res}(0, TIMEyears]
{col 6}{txt}Exit on or before: {res}failure
{col 17}{txt}Weight: {res}[pweight=sampling_weight]

{txt}{hline 74}
{res}      3,720{txt}  total observations
{res}        918{txt}  weights invalid {col 61}PROBABLE ERROR
{hline 74}
{res}      2,802{txt}  observations remaining, representing
{res}        715{txt}  failures in single-record/single-failure data
{res}   40,239.7{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res}        0
                                          {txt}Last observed exit t = {res} 18.39103
{txt}
{com}. 
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin_SMALLfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin_SMALLfin.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. **STEP 2: APPEND THE 3 COHORTS TOGETHER**
. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_SMALLfin",clear
{txt}
{com}. 
. append using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT_SMALLfin"
{txt}
{com}. append using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin_SMALLfin"
{txt}{p 0 7 2}
(variable
{bf:AGE} was {bf:float}, now {bf:double} to accommodate using data's values)
{p_end}

{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\COMBINED\NHANES_HRS_HANDLS_DATACOMBINEDfin", replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\COMBINED\NHANES_HRS_HANDLS_DATACOMBINEDfin.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}