{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. ******************************************STEP 7: PARTICIPANT FLOWCHART******************************************************************
. 
. 
. **DETERMINE SAMPLE WITH COMPLETE DATA ON TELOMERE LENGTH AND EPIGENETIC CLOCK AND WHERE RESPONDENT'S AGE IS >50 IN 2008 AND ALIVE IN 2016**
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT.dta",clear
{txt}
{com}. 
. capture drop sample50plus2008
{txt}
{com}. gen sample50plus2008=.
{txt}(46,851 missing values generated)

{com}. replace sample50plus2008=1 if r9agey_e>=50 & r9agey_e~=.
{txt}(16,861 real changes made)

{com}. replace sample50plus2008=0 if sample50plus2008~=1 & r9agey_e~=.
{txt}(356 real changes made)

{com}. 
. tab sample50plus2008

{txt}sample50plu {c |}
      s2008 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        356        2.07        2.07
{txt}          1 {c |}{res}     16,861       97.93      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     17,217      100.00
{txt}
{com}. 
. capture drop samplealivein2016
{txt}
{com}. gen samplealivein2016=.
{txt}(46,851 missing values generated)

{com}. replace samplealivein2016=1 if inw13==1
{txt}(20,912 real changes made)

{com}. replace samplealivein2016=0 if samplealivein2016~=1
{txt}(25,939 real changes made)

{com}. 
. tab samplealivein2016

{txt}samplealive {c |}
     in2016 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     25,939       55.36       55.36
{txt}          1 {c |}{res}     20,912       44.64      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     46,851      100.00
{txt}
{com}. 
. 
. capture drop sampleTL2008
{txt}
{com}. gen sampleTL2008=.
{txt}(46,851 missing values generated)

{com}. replace sampleTL2008=1 if FINAL_T_S~=. & FINAL_CV~=.
{txt}(5,808 real changes made)

{com}. replace sampleTL2008=0 if sampleTL2008~=1 
{txt}(41,043 real changes made)

{com}. 
. tab sampleTL2008

{txt}sampleTL200 {c |}
          8 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     41,043       87.60       87.60
{txt}          1 {c |}{res}      5,808       12.40      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     46,851      100.00
{txt}
{com}. 
. **Exclude outliers**
. 
. local vars FINAL_T_S FINAL_CV  // Replace with your actual variable names
{txt}
{com}. 
. capture drop FINAL_T_S_no_outliers
{txt}
{com}. capture drop FINAL_CV_no_outliers 
{txt}
{com}. 
. foreach var of varlist `vars' {c -(}
{txt}  2{com}.     // Calculate IQR
.     quietly summarize `var', detail
{txt}  3{com}.     local p25 = r(p25)
{txt}  4{com}.     local p75 = r(p75)
{txt}  5{com}.     local iqr = `p75' - `p25'
{txt}  6{com}. 
.     // Define the upper and lower bounds for outliers
.     local lower_bound = `p25' - 4 * `iqr'
{txt}  7{com}.     local upper_bound = `p75' + 4 * `iqr'
{txt}  8{com}. 
.     // Generate a new variable excluding outliers
.     gen `var'_no_outliers = `var'
{txt}  9{com}.     replace `var'_no_outliers = . if `var' < `lower_bound' | `var' > `upper_bound'
{txt} 10{com}. {c )-}
{txt}(41,043 missing values generated)
(75 real changes made, 75 to missing)
(41,043 missing values generated)
(0 real changes made)

{com}. 
. 
. capture drop sampleTL2008fin
{txt}
{com}. gen sampleTL2008fin=.
{txt}(46,851 missing values generated)

{com}. replace sampleTL2008fin=1 if sampleTL2008==1 & FINAL_T_S_no_outliers~=. & FINAL_CV_no_outliers~=.
{txt}(5,733 real changes made)

{com}. replace sampleTL2008fin=0 if sampleTL2008fin~=1
{txt}(41,118 real changes made)

{com}. 
. tab sampleTL2008fin

{txt}sampleTL200 {c |}
       8fin {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     41,118       87.76       87.76
{txt}          1 {c |}{res}      5,733       12.24      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     46,851      100.00
{txt}
{com}. 
. capture drop sampleEPI2016
{txt}
{com}. gen sampleEPI2016=.
{txt}(46,851 missing values generated)

{com}. replace sampleEPI2016=1 if HORVATH_DNAMAGE~=. & HANNUM_DNAMAGE~=. & LEVINE_DNAMAGE~=. & DNAMGRIMAGE~=. & MPOA~=. 
{txt}(4,018 real changes made)

{com}. replace sampleEPI2016=0 if sampleEPI2016~=1
{txt}(42,833 real changes made)

{com}. 
. 
. **Exclude outliers**
. local vars HORVATH_DNAMAGE HANNUM_DNAMAGE LEVINE_DNAMAGE DNAMGRIMAGE MPOA
{txt}
{com}. 
. capture drop HORVATH_DNAMAGE_no_outliers
{txt}
{com}. capture drop HANNUM_DNAMAGE_no_outliers 
{txt}
{com}. capture drop LEVINE_DNAMAGE_no_outliers 
{txt}
{com}. capture drop DNAMGRIMAGE_no_outliers 
{txt}
{com}. capture drop MPOA_no_outliers 
{txt}
{com}. 
. 
. foreach var of varlist `vars' {c -(}
{txt}  2{com}.     // Calculate IQR
.     quietly summarize `var', detail
{txt}  3{com}.     local p25 = r(p25)
{txt}  4{com}.     local p75 = r(p75)
{txt}  5{com}.     local iqr = `p75' - `p25'
{txt}  6{com}. 
.     // Define the upper and lower bounds for outliers
.     local lower_bound = `p25' - 4 * `iqr'
{txt}  7{com}.     local upper_bound = `p75' + 4 * `iqr'
{txt}  8{com}. 
.     // Generate a new variable excluding outliers
.     gen `var'_no_outliers = `var'
{txt}  9{com}.     replace `var'_no_outliers = . if `var' < `lower_bound' | `var' > `upper_bound'
{txt} 10{com}. {c )-}
{txt}(42,833 missing values generated)
(0 real changes made)
(42,833 missing values generated)
(0 real changes made)
(42,833 missing values generated)
(0 real changes made)
(42,833 missing values generated)
(0 real changes made)
(42,833 missing values generated)
(0 real changes made)

{com}. 
. 
. capture drop sampleEPI2016fin
{txt}
{com}. gen sampleEPI2016fin=.
{txt}(46,851 missing values generated)

{com}. replace sampleEPI2016fin=1 if sampleEPI2016==1 & HORVATH_DNAMAGE_no_outliers~=. & HANNUM_DNAMAGE_no_outliers~=. & LEVINE_DNAMAGE_no_outliers~=. & DNAMGRIMAGE_no_outliers~=. & MPOA_no_outliers~=. 
{txt}(4,018 real changes made)

{com}. replace sampleEPI2016fin=0 if sampleEPI2016fin~=1
{txt}(42,833 real changes made)

{com}. 
. 
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT.dta", replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT.dta{rm}
saved
{p_end}

{com}. 
. capture drop sample2
{txt}
{com}. gen sample2=.
{txt}(46,851 missing values generated)

{com}. replace sample2=1 if sample50plus2008==1 & samplealivein2016==1
{txt}(10,201 real changes made)

{com}. replace sample2=0 if sample2~=1
{txt}(36,650 real changes made)

{com}. 
. capture drop sample3
{txt}
{com}. gen sample3=.
{txt}(46,851 missing values generated)

{com}. replace sample3=1 if sample2==1 & sampleTL2008fin==1
{txt}(3,666 real changes made)

{com}. replace sample3=0 if sample3~=1
{txt}(43,185 real changes made)

{com}. 
. 
. capture drop sample4
{txt}
{com}. gen sample4=.
{txt}(46,851 missing values generated)

{com}. replace sample4=1 if sample3==1 & sampleEPI2016fin==1
{txt}(1,029 real changes made)

{com}. replace sample4=0 if sample4~=1
{txt}(45,822 real changes made)

{com}. 
. 
. capture drop sample_final
{txt}
{com}. gen sample_final=.
{txt}(46,851 missing values generated)

{com}. replace sample_final=1 if sample4==1 
{txt}(1,029 real changes made)

{com}. replace sample_final=0 if sample_final~=1
{txt}(45,822 real changes made)

{com}. 
. tab sample_final

{txt}sample_fina {c |}
          l {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     45,822       97.80       97.80
{txt}          1 {c |}{res}      1,029        2.20      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     46,851      100.00
{txt}
{com}. 
. 
. 
. tab sample_final

{txt}sample_fina {c |}
          l {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     45,822       97.80       97.80
{txt}          1 {c |}{res}      1,029        2.20      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     46,851      100.00
{txt}
{com}. 
. **Final sample size for HRS: 1,013**
. 
. 
. 
. 
. su r9agey_*

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}r9agey_b {c |}{res}     17,217    69.20154    10.76317         25        106
{txt}{space 4}r9agey_e {c |}{res}     17,217    69.20486    10.76299         25        106
{txt}{space 4}r9agey_m {c |}{res}     17,217    69.20236    10.76304         25        106
{txt}
{com}. su r13agey_*

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}r13agey_b {c |}{res}     20,912    65.69778    11.79574         21        107
{txt}{space 3}r13agey_e {c |}{res}     20,912    65.70931    11.79422         21        107
{txt}{space 3}r13agey_m {c |}{res}     20,912    65.70208    11.79486         21        107
{txt}
{com}. 
. capture drop AGE2008
{txt}
{com}. gen AGE2008=r9agey_e
{txt}(29,634 missing values generated)

{com}. 
. capture drop AGE2016
{txt}
{com}. gen AGE2016=r13agey_e
{txt}(25,939 missing values generated)

{com}. 
. su AGE2008 if sample_final==1,det

                           {txt}AGE2008
{hline 61}
      Percentiles      Smallest
 1%    {res}       51             50
{txt} 5%    {res}       54             50
{txt}10%    {res}       55             50       {txt}Obs         {res}      1,029
{txt}25%    {res}       60             50       {txt}Sum of wgt. {res}      1,029

{txt}50%    {res}       67                      {txt}Mean          {res}  66.3586
                        {txt}Largest       Std. dev.     {res} 8.309005
{txt}75%    {res}       72             87
{txt}90%    {res}       77             88       {txt}Variance      {res} 69.03957
{txt}95%    {res}       81             89       {txt}Skewness      {res} .2000269
{txt}99%    {res}       85             90       {txt}Kurtosis      {res}  2.36941
{txt}
{com}. su AGE2016 if sample_final==1,det

                           {txt}AGE2016
{hline 61}
      Percentiles      Smallest
 1%    {res}       59             58
{txt} 5%    {res}       62             58
{txt}10%    {res}       63             59       {txt}Obs         {res}      1,029
{txt}25%    {res}       68             59       {txt}Sum of wgt. {res}      1,029

{txt}50%    {res}       75                      {txt}Mean          {res} 74.51312
                        {txt}Largest       Std. dev.     {res}  8.29743
{txt}75%    {res}       80             95
{txt}90%    {res}       86             97       {txt}Variance      {res} 68.84735
{txt}95%    {res}       89             97       {txt}Skewness      {res} .2126168
{txt}99%    {res}       93             98       {txt}Kurtosis      {res} 2.374591
{txt}
{com}. 
. 
. capture drop AGE
{txt}
{com}. gen AGE=AGE2016
{txt}(25,939 missing values generated)

{com}. 
. 
. 
. 
. foreach var of varlist FINAL_T_S_no_outliers FINAL_CV_no_outliers {c -(}
{txt}  2{com}.         histogram `var'
{txt}  3{com}.         graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_TELOMERES\HRS_HIST`var'.gph",replace
{txt}  4{com}.         
. {c )-}
{txt}(bin={res}37{txt}, start={res}.19988681{txt}, width={res}.07510688{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_TELOMERES\HRS_HISTFINAL_T_S_no_outliers.gph} saved
(bin={res}37{txt}, start={res}2.640e-06{txt}, width={res}.00337771{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_TELOMERES\HRS_HISTFINAL_CV_no_outliers.gph} saved

{com}. 
. 
. 
. foreach var of varlist HORVATH_DNAMAGE_no_outliers HANNUM_DNAMAGE_no_outliers LEVINE_DNAMAGE_no_outliers DNAMGRIMAGE_no_outliers MPOA_no_outliers {c -(}
{txt}  2{com}.         histogram `var'
{txt}  3{com}.         graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_EPIGENETIC\HRS_HIST`var'.gph",replace
{txt}  4{com}.         
. {c )-}
{txt}(bin={res}36{txt}, start={res}23.307739{txt}, width={res}2.5337223{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_EPIGENETIC\HRS_HISTHORVATH_DNAMAGE_no_outliers.gph} saved
(bin={res}36{txt}, start={res}25.058701{txt}, width={res}2.2982029{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_EPIGENETIC\HRS_HISTHANNUM_DNAMAGE_no_outliers.gph} saved
(bin={res}36{txt}, start={res}26.71921{txt}, width={res}2.0821772{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_EPIGENETIC\HRS_HISTLEVINE_DNAMAGE_no_outliers.gph} saved
(bin={res}36{txt}, start={res}42.673931{txt}, width={res}1.5816783{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_EPIGENETIC\HRS_HISTDNAMGRIMAGE_no_outliers.gph} saved
(bin={res}36{txt}, start={res}.73917001{txt}, width={res}.02014222{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_EPIGENETIC\HRS_HISTMPOA_no_outliers.gph} saved

{com}. 
. 
. 
. **STEP 9: MORTALITY VARIABLES FROM 2008 THROUGH 2020: TRACKER FILE INW**
. 
. **dead vs. alive: 2016-2022
. 
. capture drop died
{txt}
{com}. gen died=.
{txt}(46,851 missing values generated)

{com}. replace died=1 if (sample_final==1 & knowndeceasedyr~=. & knowndeceasedmo~=.)
{txt}(275 real changes made)

{com}. replace died=0 if died!=1 & sample_final==1
{txt}(754 real changes made)

{com}. 
. tab died if sample_final==1

       {txt}died {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        754       73.28       73.28
{txt}          1 {c |}{res}        275       26.72      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,029      100.00
{txt}
{com}. 
. 
. **Date of death: dod**
. 
. su knowndeceasedmo knowndeceasedyr if sample_final==1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
knowndecea~o {c |}{res}        275    6.898182    6.546061          1         98
{txt}knowndecea~r {c |}{res}        275    2019.531    1.657198       2016       2023
{txt}
{com}. tab1 knowndeceasedmo knowndeceasedyr if sample_final==1

{res}-> tabulation of knowndeceasedmo if sample_final==1 

      {txt}known {c |}
 deceased - {c |}
      month {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         26        9.45        9.45
{txt}          2 {c |}{res}         21        7.64       17.09
{txt}          3 {c |}{res}         27        9.82       26.91
{txt}          4 {c |}{res}         21        7.64       34.55
{txt}          5 {c |}{res}         16        5.82       40.36
{txt}          6 {c |}{res}         20        7.27       47.64
{txt}          7 {c |}{res}         20        7.27       54.91
{txt}          8 {c |}{res}         21        7.64       62.55
{txt}          9 {c |}{res}         26        9.45       72.00
{txt}         10 {c |}{res}         32       11.64       83.64
{txt}         11 {c |}{res}         24        8.73       92.36
{txt}         12 {c |}{res}         20        7.27       99.64
{txt}         98 {c |}{res}          1        0.36      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        275      100.00

-> tabulation of knowndeceasedyr if sample_final==1 

      {txt}known {c |}
 deceased - {c |}
       year {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       2016 {c |}{res}          3        1.09        1.09
{txt}       2017 {c |}{res}         31       11.27       12.36
{txt}       2018 {c |}{res}         55       20.00       32.36
{txt}       2019 {c |}{res}         44       16.00       48.36
{txt}       2020 {c |}{res}         55       20.00       68.36
{txt}       2021 {c |}{res}         47       17.09       85.45
{txt}       2022 {c |}{res}         37       13.45       98.91
{txt}       2023 {c |}{res}          3        1.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        275      100.00
{txt}
{com}. 
. capture drop deathmonth
{txt}
{com}. gen deathmonth=knowndeceasedmo if knowndeceasedmo~=98
{txt}(27,706 missing values generated)

{com}. 
. capture drop deathyear
{txt}
{com}. gen deathyear=knowndeceasedyr
{txt}(27,567 missing values generated)

{com}. 
. capture drop deathday
{txt}
{com}. gen deathday=14
{txt}
{com}. 
. capture drop dod
{txt}
{com}. gen dod=mdy(deathmonth, deathday, deathyear)
{txt}(27,706 missing values generated)

{com}. 
. **Date of entry: doenter**
. capture drop doenter
{txt}
{com}. gen doenter=mdy(01,01,2016)
{txt}
{com}. 
. **Date of exit if still alive: doexit**
. capture drop doexit
{txt}
{com}. gen doexit=mdy(12,31,2022) 
{txt}
{com}. 
. **Date of exit for censor or dead**
. capture drop doevent
{txt}
{com}. gen doevent=.
{txt}(46,851 missing values generated)

{com}. replace doevent=dod if died==1 & sample_final==1
{txt}(274 real changes made)

{com}. replace doevent=doexit if died==0 & sample_final==1
{txt}(754 real changes made)

{com}. 
. su doevent

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}doevent {c |}{res}      1,028    22721.56    568.5428      20802      23083
{txt}
{com}. 
. ***Estimated birth date**
. 
. capture drop dob
{txt}
{com}. gen dob=mdy(birthmo,14,birthyr)
{txt}(813 missing values generated)

{com}. 
. 
. 
. capture drop ageevent
{txt}
{com}. gen ageevent=(doevent-dob)/365.5
{txt}(45,823 missing values generated)

{com}. 
. su ageevent

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ageevent {c |}{res}      1,028    80.52331    7.878153   61.12449   101.0999
{txt}
{com}. 
. capture drop ageenter
{txt}
{com}. gen ageenter=AGE2016
{txt}(25,939 missing values generated)

{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT.dta",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT.dta{rm}
saved
{p_end}

{com}. 
. **STEP 10: STSET FOR MORTALITY OUTCOME***
. capture drop time_event
{txt}
{com}. gen time_event=ageevent-AGE2016
{txt}(45,823 missing values generated)

{com}. 
. su time_event,det

                         {txt}time_event
{hline 61}
      Percentiles      Smallest
 1%    {res} 1.207932       .4569092
{txt} 5%    {res} 2.103966        .615593
{txt}10%    {res} 3.201096         .77565       {txt}Obs         {res}      1,028
{txt}25%    {res} 6.001366       .7879639       {txt}Sum of wgt. {res}      1,028

{txt}50%    {res} 6.656631                      {txt}Mean          {res} 6.025257
                        {txt}Largest       Std. dev.     {res} 1.587761
{txt}75%    {res} 6.990425       7.496582
{txt}90%    {res}   7.2435       7.497948       {txt}Variance      {res} 2.520984
{txt}95%    {res} 7.328316       7.500687       {txt}Skewness      {res}-1.698806
{txt}99%    {res} 7.488373       7.581398       {txt}Kurtosis      {res} 4.796597
{txt}
{com}. histogram time_event
{txt}(bin={res}30{txt}, start={res}.45690918{txt}, width={res}.23748296{txt})
{res}{txt}
{com}. 
. tab sample_final

{txt}sample_fina {c |}
          l {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     45,822       97.80       97.80
{txt}          1 {c |}{res}      1,029        2.20      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     46,851      100.00
{txt}
{com}. 
. 
. stset time_event [pweight=vbsi16wgtra] if sample_final==1, failure(died==1) scale(1)

{txt}Survival-time data settings

{col 10}Failure event: {res}died==1
{col 1}{txt}Observed time interval: {res}(0, time_event]
{col 6}{txt}Exit on or before: {res}failure
{col 17}{txt}Weight: {res}[pweight=vbsi16wgtra]
{col 7}{txt}Keep observations 
{col 17}{help j_st_ifvsoptif:{bf:if} {it:exp}}: {res}sample_final==1

{txt}{hline 74}
{res}     46,851{txt}  total observations
{res}     45,822{txt}  ignored at outset because of {bf:if} {it:exp}
{res}          1{txt}  event time missing (time_event>=.){col 61}PROBABLE ERROR
{hline 74}
{res}      1,028{txt}  observations remaining, representing
{res}        274{txt}  failures in single-record/single-failure data
{res}  6,193.964{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res}        0
                                          {txt}Last observed exit t = {res} 7.581398
{txt}
{com}. 
. 
. stdescribe if sample_final==1

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}time_event
{col 13}{txt}Weight: {res}[pweight=vbsi16wgtra]

{txt}{col 36}{c LT}{hline 14} Per subject {hline 14}{c RT}
Category{col 28}Total{col 41}Mean{col 54}Min{col 62}Median{col 76}Max
{hline 78}
Number of subjects    {res}      1028   
{txt}Number of records     {res}      1028           1           1          1          1

{txt}Entry time (first)                 {res}        0           0          0          0
{txt}Exit time (final)                  {res} 6.025257    .4569092   6.656631   7.581398

{txt}Subjects with gap     {res}         0   
{txt}Time on gap           {res}         0   
{txt}Time at risk          {res} 6193.9644    6.025257    .4569092   6.656631   7.581398

{txt}Failures              {res}       274     .266537           0          0          1
{txt}{hline 78}
Note: Reported estimates of total, mean, and median are unweighted.

{com}. stsum if sample_final==1

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}time_event
{col 13}{txt}Weight: {res}[pweight=vbsi16wgtra]

{txt}{col 10}{c |}{col 26}Incidence{col 40}Number of{col 52}{c LT}{hline 6} Survival time {hline 5}{c RT}
        {col 10}{c |} Time at risk{col 31}rate{col 41}subjects{col 57}25%{col 67}50%{col 77}75%
{hline 9}{c +}{hline 69}
   Total {c |} {res} 125358584.4    .037682{col 40} 2.05e+07   7.276337         .         .
{txt}
{com}. strate if sample_final==1

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}time_event
{col 13}{txt}Weight: {res}[pweight=vbsi16wgtra]

{txt}Estimated failure rates

Number of records  = {res}1028
{txt}Number of clusters = {res}1028
{txt}
  {c TLC}{hline 9}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
  {c |} {res}      D         Y       Rate      Lower      Upper {txt}{c |}
  {c LT}{hline 9}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  {c |} {res}4723765   1.3e+08   0.037682   0.032740   0.043531 {txt}{c |}
  {c BLC}{hline 9}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}
   Notes: Rate = D/Y = failures/person-time.
          Lower and Upper are bounds of 95% jackknife
          confidence intervals.


{com}. 
. 
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT.dta",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. **Inverse mills ratio**
. 
. capture drop sample_final_age50plus
{txt}
{com}. gen sample_final_age50plus=.
{txt}(46,851 missing values generated)

{com}. replace sample_final_age50plus=1 if sample_final==1
{txt}(1,029 real changes made)

{com}. replace sample_final_age50plus=0 if sample_final==0 & AGE>=50 & AGE~=.
{txt}(19,119 real changes made)

{com}. 
. tab sample_final_age50plus

{txt}sample_fina {c |}
l_age50plus {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     19,119       94.89       94.89
{txt}          1 {c |}{res}      1,029        5.11      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     20,148      100.00
{txt}
{com}. 
. 
. xi:probit sample_final_age50plus AGE SEX i.RACE_ETHN
{txt}i.RACE_ETHN{col 19}_IRACE_ETHN_1-4{col 39}(naturally coded; _IRACE_ETHN_1 omitted)

{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-4060.7862}  
Iteration 1:{space 2}Log likelihood = {res:-3762.4715}  
Iteration 2:{space 2}Log likelihood = {res:-3749.7621}  
Iteration 3:{space 2}Log likelihood = {res:-3749.7073}  
Iteration 4:{space 2}Log likelihood = {res:-3749.7073}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:20,105}
{txt}{col 57}{lalign 13:LR chi2({res:5})}{col 70} = {res}{ralign 6:622.16}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-3749.7073}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0766}

{txt}{hline 23}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sample_final_age50plus{col 24}{c |} Coefficient{col 36}  Std. err.{col 48}      z{col 56}   P>|z|{col 64}     [95% con{col 77}f. interval]
{hline 23}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 19}AGE {c |}{col 24}{res}{space 2} .0291572{col 36}{space 2} .0014291{col 47}{space 1}   20.40{col 56}{space 3}0.000{col 64}{space 4} .0263562{col 77}{space 3} .0319582
{txt}{space 19}SEX {c |}{col 24}{res}{space 2} .0292816{col 36}{space 2} .0316795{col 47}{space 1}    0.92{col 56}{space 3}0.355{col 64}{space 4}-.0328091{col 77}{space 3} .0913723
{txt}{space 9}_IRACE_ETHN_2 {c |}{col 24}{res}{space 2}-.3339617{col 36}{space 2} .0470797{col 47}{space 1}   -7.09{col 56}{space 3}0.000{col 64}{space 4}-.4262361{col 77}{space 3}-.2416872
{txt}{space 9}_IRACE_ETHN_3 {c |}{col 24}{res}{space 2}-.1784386{col 36}{space 2} .0487101{col 47}{space 1}   -3.66{col 56}{space 3}0.000{col 64}{space 4}-.2739086{col 77}{space 3}-.0829686
{txt}{space 9}_IRACE_ETHN_4 {c |}{col 24}{res}{space 2}-.3197825{col 36}{space 2} .0980995{col 47}{space 1}   -3.26{col 56}{space 3}0.001{col 64}{space 4}-.5120539{col 77}{space 3}-.1275111
{txt}{space 17}_cons {c |}{col 24}{res}{space 2}-3.599755{col 36}{space 2} .1077385{col 47}{space 1}  -33.41{col 56}{space 3}0.000{col 64}{space 4}-3.810919{col 77}{space 3}-3.388592
{txt}{hline 23}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. capture drop p1fin
{txt}
{com}. predict p1fin, xb
{txt}(25984 missing values generated)

{com}. 
. capture drop phifin
{txt}
{com}. capture drop caphifin
{txt}
{com}. capture drop invmillsfin
{txt}
{com}. 
. gen phifin=(1/sqrt(2*_pi))*exp(-(p1fin^2/2))
{txt}(25,984 missing values generated)

{com}. 
. egen caphifin=std(p1fin)
{txt}(25,984 missing values generated)

{com}. 
. capture drop invmillsfin
{txt}
{com}. gen invmillsfin=phifin/caphifin
{txt}(25,984 missing values generated)

{com}. 
. 
. su invmillsfin

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}invmillsfin {c |}{res}     20,867    .0232327    .6261349  -3.686808   5.482571
{txt}
{com}. histogram invmillsfin
{txt}(bin={res}43{txt}, start={res}-3.6868083{txt}, width={res}.21324138{txt})
{res}{txt}
{com}. 
. 
. 
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT.dta",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. **STEP 10: GENERATE EAA and Z-SCORES FOR EXPOSURES**
. 
. capture drop AGE
{txt}
{com}. gen AGE=AGE2016
{txt}(25,939 missing values generated)

{com}. 
. su AGE if sample_final==1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}AGE {c |}{res}      1,029    74.51312     8.29743         58         98
{txt}
{com}. histogram AGE if sample_final==1
{txt}(bin={res}30{txt}, start={res}58{txt}, width={res}1.3333333{txt})
{res}{txt}
{com}. 
. capture drop HORVATH_DNAMAGE_no_outliersEAA    
{txt}
{com}. capture drop HANNUM_DNAMAGE_no_outliersEAA 
{txt}
{com}. capture drop LEVINE_DNAMAGE_no_outliersEAA 
{txt}
{com}. capture drop DNAMGRIMAGE_no_outliersEAA   
{txt}
{com}. 
. 
. foreach var of varlist HORVATH_DNAMAGE_no_outliers HANNUM_DNAMAGE_no_outliers LEVINE_DNAMAGE_no_outliers DNAMGRIMAGE_no_outliers {c -(}
{txt}  2{com}.         
.         reg `var' AGE 
{txt}  3{com}.         predict `var'EAA, resid
{txt}  4{com}.         histogram `var'EAA
{txt}  5{com}.         graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_EPIGENETIC\HRS_HIST`var'EAA.gph", replace
{txt}  6{com}.         su `var'EAA
{txt}  7{com}. {c )-}

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,018
{txt}{hline 13}{c +}{hline 34}   F(1, 4016)      = {res}  4900.68
{txt}       Model {c |} {res} 204198.485         1  204198.485   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 167336.272     4,016  41.6673985   {txt}R-squared       ={res}    0.5496
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5495
{txt}       Total {c |} {res} 371534.758     4,017  92.4906043   {txt}Root MSE        =   {res}  6.455

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}HORVATH_DN~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}AGE {c |}{col 14}{res}{space 2} .7406215{col 26}{space 2} .0105796{col 37}{space 1}   70.00{col 46}{space 3}0.000{col 54}{space 4} .7198796{col 67}{space 3} .7613633
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 14.26264{col 26}{space 2} .7421424{col 37}{space 1}   19.22{col 46}{space 3}0.000{col 54}{space 4} 12.80763{col 67}{space 3} 15.71765
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(42,833 missing values generated)
(bin={res}36{txt}, start={res}-36.132813{txt}, width={res}2.348567{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_EPIGENETIC\HRS_HISTHORVATH_DNAMAGE_no_outliersEAA.gph} saved

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
HORVATH_DN~A {c |}{res}      4,018   -6.48e-10    6.454225  -36.13281    48.4156

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,018
{txt}{hline 13}{c +}{hline 34}   F(1, 4016)      = {res}  8418.39
{txt}       Model {c |} {res} 231707.766         1  231707.766   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 110536.351     4,016  27.5239919   {txt}R-squared       ={res}    0.6770
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6769
{txt}       Total {c |} {res} 342244.117     4,017  85.1989338   {txt}Root MSE        =   {res} 5.2463

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}HANNUM_DNA~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}AGE {c |}{col 14}{res}{space 2} .7889334{col 26}{space 2} .0085986{col 37}{space 1}   91.75{col 46}{space 3}0.000{col 54}{space 4} .7720754{col 67}{space 3} .8057913
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.2293061{col 26}{space 2}  .603177{col 37}{space 1}   -0.38{col 46}{space 3}0.704{col 54}{space 4}-1.411868{col 67}{space 3} .9532554
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(42,833 missing values generated)
(bin={res}36{txt}, start={res}-30.57519{txt}, width={res}2.0967731{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_EPIGENETIC\HRS_HISTHANNUM_DNAMAGE_no_outliersEAA.gph} saved

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
HANNUM_DNA~A {c |}{res}      4,018   -1.13e-08    5.245678  -30.57519   44.90864

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,018
{txt}{hline 13}{c +}{hline 34}   F(1, 4016)      = {res}  4709.40
{txt}       Model {c |} {res} 220274.251         1  220274.251   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 187841.611     4,016  46.7733096   {txt}R-squared       ={res}    0.5397
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5396
{txt}       Total {c |} {res} 408115.863     4,017  101.597178   {txt}Root MSE        =   {res} 6.8391

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LEVINE_DNA~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}AGE {c |}{col 14}{res}{space 2} .7692224{col 26}{space 2} .0112091{col 37}{space 1}   68.63{col 46}{space 3}0.000{col 54}{space 4} .7472464{col 67}{space 3} .7911984
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 4.029403{col 26}{space 2} .7862996{col 37}{space 1}    5.12{col 46}{space 3}0.000{col 54}{space 4}  2.48782{col 67}{space 3} 5.570987
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(42,833 missing values generated)
(bin={res}36{txt}, start={res}-28.078871{txt}, width={res}1.9478243{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_EPIGENETIC\HRS_HISTLEVINE_DNAMAGE_no_outliersEAA.gph} saved

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
LEVINE_DNA~A {c |}{res}      4,018    1.11e-08     6.83825  -28.07887    42.0428

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,018
{txt}{hline 13}{c +}{hline 34}   F(1, 4016)      = {res}  9263.64
{txt}       Model {c |} {res} 208691.744         1  208691.744   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 90472.6664     4,016  22.5280544   {txt}R-squared       ={res}    0.6976
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6975
{txt}       Total {c |} {res} 299164.411     4,017  74.4745857   {txt}Root MSE        =   {res} 4.7464

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}DNAMGRIMAG~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}AGE {c |}{col 14}{res}{space 2} .7487256{col 26}{space 2} .0077791{col 37}{space 1}   96.25{col 46}{space 3}0.000{col 54}{space 4} .7334742{col 67}{space 3}  .763977
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 16.10313{col 26}{space 2} .5456961{col 37}{space 1}   29.51{col 46}{space 3}0.000{col 54}{space 4} 15.03326{col 67}{space 3} 17.17299
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(42,833 missing values generated)
(bin={res}36{txt}, start={res}-16.949423{txt}, width={res}1.0938289{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_EPIGENETIC\HRS_HISTDNAMGRIMAGE_no_outliersEAA.gph} saved

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
DNAMGRIMAG~A {c |}{res}      4,018    7.66e-10    4.745782  -16.94942   22.42842
{txt}
{com}. 
. su  MPOA_no_outliers

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
MPOA_no_ou~s {c |}{res}      4,018    1.075154    .0916328     .73917    1.46429
{txt}
{com}. histogram MPOA_no_outliers
{txt}(bin={res}36{txt}, start={res}.73917001{txt}, width={res}.02014222{txt})
{res}{txt}
{com}. graph save  "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_EPIGENETIC\HRS_HISTDunedinPoAmEAA.gph", replace
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_EPIGENETIC\HRS_HISTDunedinPoAmEAA.gph} saved

{com}.  
. 
. 
. *******Z-SCORE*************
. 
. capture drop zHORVATH_DNAMAGE_no_outliersEAA 
{txt}
{com}. capture drop zHANNUM_DNAMAGE_no_outliersEAA 
{txt}
{com}. capture drop zLEVINE_DNAMAGE_no_outliersEAA 
{txt}
{com}. capture drop zDNAMGRIMAGE_no_outliersEAA 
{txt}
{com}. capture drop zMPOA_no_outliers 
{txt}
{com}. capture drop zFINAL_T_S_no_outliers
{txt}
{com}. foreach var of varlist HORVATH_DNAMAGE_no_outliersEAA HANNUM_DNAMAGE_no_outliersEAA LEVINE_DNAMAGE_no_outliersEAA DNAMGRIMAGE_no_outliersEAA MPOA_no_outliers FINAL_T_S_no_outliers {c -(}
{txt}  2{com}.         
.         egen z`var'=std(`var') if sample_final==1
{txt}  3{com}. {c )-}
{txt}(45,822 missing values generated)
(45,822 missing values generated)
(45,822 missing values generated)
(45,822 missing values generated)
(45,822 missing values generated)
(45,822 missing values generated)

{com}. 
. su z*

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
zHorvathAg~A {c |}{res}      1,029   -3.02e-10           1   -4.54528   7.045863
{txt}zHannumAge~A {c |}{res}      1,029    9.82e-10           1   -4.69895   6.328933
{txt}zPhenoAgeEAA {c |}{res}      1,029    1.26e-10           1   -4.07774   4.480077
{txt}zGrimAgeMo~A {c |}{res}      1,029   -3.52e-10           1  -2.898001   4.308195
{txt}zDunedinPoAm {c |}{res}      1,029   -1.15e-09           1  -3.642164   3.999476
{txt}{hline 13}{c +}{hline 57}
ztelomean_~s {c |}{res}      1,029   -1.27e-11           1  -3.350833   4.854955
{txt}zHorvathAg~t {c |}{res}        436    1.997706    .8178999          1          3
{txt}zHannumAge~t {c |}{res}        436    1.997706    .8178999          1          3
{txt}zPhenoAgeE~t {c |}{res}        436    1.997706    .8178999          1          3
{txt}zGrimAgeMo~t {c |}{res}        436    1.997706    .8178999          1          3
{txt}{hline 13}{c +}{hline 57}
zDunedinPo~t {c |}{res}        436    1.997706    .8178999          1          3
{txt}ztelomean_~t {c |}{res}        436    1.997706    .8178999          1          3
{txt}zHORVATH_D~A {c |}{res}      1,029   -3.02e-10           1   -4.54528   7.045863
{txt}zHANNUM_DN~A {c |}{res}      1,029    9.82e-10           1   -4.69895   6.328933
{txt}zLEVINE_DN~A {c |}{res}      1,029    1.26e-10           1   -4.07774   4.480077
{txt}{hline 13}{c +}{hline 57}
zDNAMGRIMA~A {c |}{res}      1,029   -3.52e-10           1  -2.898001   4.308195
{txt}zMPOA_no_o~s {c |}{res}      1,029   -1.15e-09           1  -3.642164   3.999476
{txt}zFINAL_T_S~s {c |}{res}      1,029   -1.27e-11           1  -3.350833   4.854955
{txt}
{com}.  
. 
.  
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT.dta",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT.dta{rm}
saved
{p_end}

{com}. 
. 
. **STEP 11: GENERATE COVARIATES:**
. 
. su AGE 

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}AGE {c |}{res}     20,912    65.70931    11.79422         21        107
{txt}
{com}. tab1 SEX RACE_ETHN

{res}-> tabulation of SEX  

        {txt}SEX {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     18,642       43.96       43.96
{txt}          1 {c |}{res}     23,763       56.04      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     42,405      100.00

-> tabulation of RACE_ETHN  

  {txt}RACE_ETHN {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     27,571       65.15       65.15
{txt}          2 {c |}{res}      7,923       18.72       83.87
{txt}          3 {c |}{res}      5,254       12.42       96.29
{txt}          4 {c |}{res}      1,571        3.71      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     42,319      100.00
{txt}
{com}. 
. capture drop SEX
{txt}
{com}. gen SEX=ragender
{txt}(4,446 missing values generated)

{com}. recode SEX (1=0) (2=1)
{txt}(42,405 changes made to {bf:SEX})

{com}. tab SEX

        {txt}SEX {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     18,642       43.96       43.96
{txt}          1 {c |}{res}     23,763       56.04      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     42,405      100.00
{txt}
{com}. 
. capture drop NHB
{txt}
{com}. gen NHB=.
{txt}(46,851 missing values generated)

{com}. replace NHB=1 if RACE_ETHN==2
{txt}(7,923 real changes made)

{com}. replace NHB=0 if NHB~=1
{txt}(38,928 real changes made)

{com}. 
. capture drop HISP
{txt}
{com}. gen HISP=.
{txt}(46,851 missing values generated)

{com}. replace HISP=1 if RACE_ETHN==3
{txt}(5,254 real changes made)

{com}. replace HISP=0 if HISP~=1
{txt}(41,597 real changes made)

{com}. 
. capture drop OTHER
{txt}
{com}. gen OTHER=.
{txt}(46,851 missing values generated)

{com}. replace OTHER=1 if RACE_ETHN==4
{txt}(1,571 real changes made)

{com}. replace OTHER=0 if OTHER~=1
{txt}(45,280 real changes made)

{com}. 
. tab1 NHB HISP OTHER

{res}-> tabulation of NHB  

        {txt}NHB {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     38,928       83.09       83.09
{txt}          1 {c |}{res}      7,923       16.91      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     46,851      100.00

-> tabulation of HISP  

       {txt}HISP {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     41,597       88.79       88.79
{txt}          1 {c |}{res}      5,254       11.21      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     46,851      100.00

-> tabulation of OTHER  

      {txt}OTHER {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     45,280       96.65       96.65
{txt}          1 {c |}{res}      1,571        3.35      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     46,851      100.00
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT.dta",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT.dta{rm}
saved
{p_end}

{com}. 
. capture log close
{smcl}
{com}{sf}{ul off}