{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. //STEP 12: CORRELATION MATRIX BETWEEN EPIGENTIC AGE ACCELERATION, EPIGENETIC CLOCKS AND TL VARIABLES//
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",clear
{txt}
{com}. 
. 
. // Step 1: Run the correlation command and save the matrix
. corr zHorvathAgeEAA zHannumAgeEAA zDunedinPoAm ztelomean_no_outliers  
{txt}(obs=92)

             {c |} zHorva~A zHannu~A zDuned~m ztelom~s
{hline 13}{c +}{hline 36}
zHorvathAg~A {c |}{res}   1.0000
{txt}zHannumAge~A {c |}{res}   0.5143   1.0000
{txt}zDunedinPoAm {c |}{res}   0.1864   0.2028   1.0000
{txt}ztelomean_~s {c |}{res}  -0.0776  -0.0866   0.0460   1.0000

{txt}
{com}. matrix C = r(C)
{txt}
{com}. 
. // Step 2: Clear the current dataset (optional if you don't need it)
. clear
{txt}
{com}. 
. // Step 3: Convert the matrix to a dataset with unique variable names
. svmat C, names(col)
{txt}number of observations will be reset to 4
Press any key to continue, or Break to abort
{p}
Number of observations ({bf:_N}) was 0,
now 4.
{p_end}

{com}. 
. // Step 4: Save the dataset as a CSV file
. export delimited using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\OUTPUT\HANDLS_correlation_matrix.csv", replace
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\OUTPUT\HANDLS_correlation_matrix.csv} saved

{com}. 
. **Add a column in excel sheet and re-type labels mannually. Change labels as needed. 
. 
. 
. // Step 5: Reload your original dataset if needed
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",clear
{txt}
{com}. 
. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}