{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. //STEP 15: HEATMAP FOR EACH TELOMERE LENGTH, EPIGENETIC CLOCKS VS. MORTALITY RISK, ADJUSTING AGE, SEX AND RACE: COX MODEL///
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",clear
{txt}
{com}. 
. stset TIMEyears [pweight=exam_base_wt], id(HNDID) failure(DIED==1)

{txt}Survival-time data settings

{col 12}ID variable: {res}HNDID
{col 10}{txt}Failure event: {res}DIED==1
{col 1}{txt}Observed time interval: {res}(TIMEyears[_n-1], TIMEyears]
{col 6}{txt}Exit on or before: {res}failure
{col 17}{txt}Weight: {res}[pweight=exam_base_wt]

{txt}{hline 74}
{res}      3,720{txt}  total observations
{res}        918{txt}  weights invalid {col 61}PROBABLE ERROR
{hline 74}
{res}      2,802{txt}  observations remaining, representing
{res}      2,802{txt}  subjects
{res}        715{txt}  failures in single-failure-per-subject data
{res}   40,239.7{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res}        0
                                          {txt}Last observed exit t = {res} 18.39103
{txt}
{com}. 
. 
. * Install estout if not already installed
. ssc install estout, replace
{txt}checking {hilite:estout} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. 
. * Clear any previous estimates
. est clear
{res}{txt}
{com}. 
. * Start the loop
. foreach x of varlist zHorvathAgeEAA zHannumAgeEAA zDunedinPoAm ztelomean_no_outliers    {c -(} 
{txt}  2{com}.     
.         * Run the stcox command
.         stcox `x' AGE SEX i.RACE 
{txt}  3{com}.         
.         * Store the estimates
.         eststo output`x'
{txt}  4{com}.     {c )-}

{col 9}{txt}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}HNDID
{col 13}{txt}Weight: {res}[pweight=exam_base_wt]

{txt}(sum of wgt is 41,472.0132856369)
Iteration 0:  Log pseudolikelihood = {res}-67588.083
{txt}Iteration 1:  Log pseudolikelihood = {res}-65798.618
{txt}Iteration 2:  Log pseudolikelihood = {res}-65764.608
{txt}Iteration 3:  Log pseudolikelihood = {res}-65764.547
{txt}Refining estimates:
Iteration 0:  Log pseudolikelihood = {res}-65764.547

{txt}Cox regression with no ties

No. of subjects = {res}{ralign 11:41,472}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:467}
{txt}No. of failures = {res}{ralign 11:6,477}
{txt}Time at risk    = {res}{ralign 11:654,347.592}
{col 57}{txt}{lalign 13:Wald chi2({res:4})} = {res}{ralign 6:19.62}
{txt}Log pseudolikelihood = {res}-65764.547{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0006}

{txt}{ralign 80:(Std. err. adjusted for {res:467} clusters in {res:HNDID})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}            _t{col 16}{c |} Haz. ratio{col 28}   std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
zHorvathAgeEAA {c |}{col 16}{res}{space 2} .9554572{col 28}{space 2}  .142913{col 39}{space 1}   -0.30{col 48}{space 3}0.761{col 56}{space 4} .7126764{col 69}{space 3} 1.280944
{txt}{space 11}AGE {c |}{col 16}{res}{space 2}  1.09081{col 28}{space 2} .0241791{col 39}{space 1}    3.92{col 48}{space 3}0.000{col 56}{space 4} 1.044435{col 69}{space 3} 1.139245
{txt}{space 11}SEX {c |}{col 16}{res}{space 2} .6725021{col 28}{space 2} .1993341{col 39}{space 1}   -1.34{col 48}{space 3}0.181{col 56}{space 4} .3761767{col 69}{space 3} 1.202252
{txt}{space 8}1.RACE {c |}{col 16}{res}{space 2} .9323479{col 28}{space 2} .2706405{col 39}{space 1}   -0.24{col 48}{space 3}0.809{col 56}{space 4} .5278281{col 69}{space 3} 1.646886
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}HNDID
{col 13}{txt}Weight: {res}[pweight=exam_base_wt]

{txt}(sum of wgt is 41,472.0132856369)
Iteration 0:  Log pseudolikelihood = {res}-67588.083
{txt}Iteration 1:  Log pseudolikelihood = {res}-65485.866
{txt}Iteration 2:  Log pseudolikelihood = {res}-65434.175
{txt}Iteration 3:  Log pseudolikelihood = {res}-65434.159
{txt}Refining estimates:
Iteration 0:  Log pseudolikelihood = {res}-65434.159

{txt}Cox regression with no ties

No. of subjects = {res}{ralign 11:41,472}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:467}
{txt}No. of failures = {res}{ralign 11:6,477}
{txt}Time at risk    = {res}{ralign 11:654,347.592}
{col 57}{txt}{lalign 13:Wald chi2({res:4})} = {res}{ralign 6:19.13}
{txt}Log pseudolikelihood = {res}-65434.159{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0007}

{txt}{ralign 79:(Std. err. adjusted for {res:467} clusters in {res:HNDID})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}           _t{col 15}{c |} Haz. ratio{col 27}   std. err.{col 39}      z{col 47}   P>|z|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
zHannumAgeEAA {c |}{col 15}{res}{space 2} 1.362926{col 27}{space 2}  .186013{col 38}{space 1}    2.27{col 47}{space 3}0.023{col 55}{space 4} 1.043037{col 68}{space 3} 1.780921
{txt}{space 10}AGE {c |}{col 15}{res}{space 2}  1.09437{col 27}{space 2} .0239126{col 38}{space 1}    4.13{col 47}{space 3}0.000{col 55}{space 4} 1.048492{col 68}{space 3} 1.142256
{txt}{space 10}SEX {c |}{col 15}{res}{space 2} .7839504{col 27}{space 2} .2251808{col 38}{space 1}   -0.85{col 47}{space 3}0.397{col 55}{space 4} .4464683{col 68}{space 3} 1.376533
{txt}{space 7}1.RACE {c |}{col 15}{res}{space 2} 1.005343{col 27}{space 2} .2807826{col 38}{space 1}    0.02{col 47}{space 3}0.985{col 55}{space 4}  .581543{col 68}{space 3} 1.737987
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}HNDID
{col 13}{txt}Weight: {res}[pweight=exam_base_wt]

{txt}(sum of wgt is 41,472.0132856369)
Iteration 0:  Log pseudolikelihood = {res}-67588.083
{txt}Iteration 1:  Log pseudolikelihood = {res}-65003.758
{txt}Iteration 2:  Log pseudolikelihood = {res} -64965.04
{txt}Iteration 3:  Log pseudolikelihood = {res}-64964.971
{txt}Refining estimates:
Iteration 0:  Log pseudolikelihood = {res}-64964.971

{txt}Cox regression with no ties

No. of subjects = {res}{ralign 11:41,472}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:467}
{txt}No. of failures = {res}{ralign 11:6,477}
{txt}Time at risk    = {res}{ralign 11:654,347.592}
{col 57}{txt}{lalign 13:Wald chi2({res:4})} = {res}{ralign 6:24.33}
{txt}Log pseudolikelihood = {res}-64964.971{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0001}

{txt}{ralign 78:(Std. err. adjusted for {res:467} clusters in {res:HNDID})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          _t{col 14}{c |} Haz. ratio{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
zDunedinPoAm {c |}{col 14}{res}{space 2} 1.713499{col 26}{space 2} .2357729{col 37}{space 1}    3.91{col 46}{space 3}0.000{col 54}{space 4} 1.308461{col 67}{space 3} 2.243918
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} 1.086052{col 26}{space 2} .0240837{col 37}{space 1}    3.72{col 46}{space 3}0.000{col 54}{space 4} 1.039859{col 67}{space 3} 1.134296
{txt}{space 9}SEX {c |}{col 14}{res}{space 2} .6585227{col 26}{space 2} .2014879{col 37}{space 1}   -1.37{col 46}{space 3}0.172{col 54}{space 4} .3615172{col 67}{space 3} 1.199534
{txt}{space 6}1.RACE {c |}{col 14}{res}{space 2}  .689698{col 26}{space 2} .1979186{col 37}{space 1}   -1.29{col 46}{space 3}0.195{col 54}{space 4} .3930019{col 67}{space 3} 1.210384
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}HNDID
{col 13}{txt}Weight: {res}[pweight=exam_base_wt]

{txt}(sum of wgt is 5,980.33077526093)
Iteration 0:  Log pseudolikelihood = {res}-7388.7385
{txt}Iteration 1:  Log pseudolikelihood = {res}-6451.6146
{txt}Iteration 2:  Log pseudolikelihood = {res}-6305.7512
{txt}Iteration 3:  Log pseudolikelihood = {res}-6292.5698
{txt}Iteration 4:  Log pseudolikelihood = {res}-6292.4639
{txt}Iteration 5:  Log pseudolikelihood = {res}-6292.4639
{txt}Refining estimates:
Iteration 0:  Log pseudolikelihood = {res}-6292.4639

{txt}Cox regression with no ties

No. of subjects = {res}{ralign 11:5,980}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:91}
{txt}No. of failures = {res}{ralign 11:861}
{txt}Time at risk    = {res}{ralign 11:92,428.3227}
{col 57}{txt}{lalign 13:Wald chi2({res:4})} = {res}{ralign 6:31.01}
{txt}Log pseudolikelihood = {res}-6292.4639{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{ralign 87:(Std. err. adjusted for {res:91} clusters in {res:HNDID})}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                   _t{col 23}{c |} Haz. ratio{col 35}   std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
ztelomean_no_outliers {c |}{col 23}{res}{space 2} 1.545738{col 35}{space 2} .3177459{col 46}{space 1}    2.12{col 55}{space 3}0.034{col 63}{space 4} 1.033143{col 76}{space 3} 2.312656
{txt}{space 18}AGE {c |}{col 23}{res}{space 2} 1.340409{col 35}{space 2} .1051128{col 46}{space 1}    3.74{col 55}{space 3}0.000{col 63}{space 4} 1.149443{col 76}{space 3} 1.563102
{txt}{space 18}SEX {c |}{col 23}{res}{space 2} .4340915{col 35}{space 2} .2769442{col 46}{space 1}   -1.31{col 55}{space 3}0.191{col 63}{space 4} .1243159{col 76}{space 3} 1.515779
{txt}{space 15}1.RACE {c |}{col 23}{res}{space 2} .7810585{col 35}{space 2} .4727371{col 46}{space 1}   -0.41{col 55}{space 3}0.683{col 63}{space 4} .2385021{col 76}{space 3} 2.557849
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. 
. 
. * Export the results to a dataset
. esttab using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\results_TABLE5.csv", replace se ar2
{res}{txt}(output written to {browse  `"E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\results_TABLE5.csv"'})

{com}. 
. import delimited "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\results_TABLE5.csv", clear
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(5 vars, 22 obs)

{com}. 
. 
. * Convert the CSV file to a Stata dataset (if needed)
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\results_TABLE5.dta",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\results_TABLE5.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. **Fix the dataset so it is simpler. This is saved as : cleaned_results_TABLE5_final.csv in the same folder**
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",clear
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}