{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. //STEP 1: EPIGENETIC CLOCK AND TELOMERE LENGTH DATA MANAGEMENT//
. 
. cd "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\RAW_DATA\HANDLS_DATA\"
{res}E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\RAW_DATA\HANDLS_DATA
{txt}
{com}. 
. 
. use 2024-12-20_telo_epi,clear
{txt}
{com}. capture rename HNDid HNDID
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
2024-12-20_telo_epi.dta{rm}
saved
{p_end}

{com}. 
. use Age_w1,clear
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
Age_w1.dta{rm}
saved
{p_end}

{com}. 
. use exam_base_wt,clear
{txt}(Written by R.              )

{com}. capture rename hndid HNDID
{txt}
{com}. sort HNDID
{txt}
{com}. capture drop _merge
{txt}
{com}. save exam_base_wt,replace
{txt}{p 0 4 2}
file {bf}
exam_base_wt.dta{rm}
saved
{p_end}

{com}. 
. use 2024-12-20_telo_epi,clear
{txt}
{com}. merge HNDID using Age_w1
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          3 {c |}{res}      3,720      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HNDID
{txt}
{com}. save 2024-12-20_telo_epi,replace
{txt}{p 0 4 2}
file {bf}
2024-12-20_telo_epi.dta{rm}
saved
{p_end}

{com}. merge HNDID using exam_base_wt
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          3 {c |}{res}      3,720      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. capture drop _merge
{txt}
{com}. sort HNDID
{txt}
{com}. 
. 
. save HANDLS_MERGED_DATASET, replace
{txt}{p 0 4 2}
file {bf}
HANDLS_MERGED_DATASET.dta{rm}
saved
{p_end}

{com}. 
. su 

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}rownames {c |}{res}      3,720      1860.5    1074.016          1       3720
{txt}{space 7}HNDID {c |}{res}      3,720    8.16e+09    4.20e+07   8.03e+09   8.22e+09
{txt}{space 9}Sex {c |}{res}      3,720    1.452957     .497849          1          2
{txt}{space 8}Race {c |}{res}      3,720     1.59086    .4917412          1          2
{txt}{space 5}tLength {c |}{res}        363    5.643691    .7191236        2.6        8.5
{txt}{hline 13}{c +}{hline 57}
{space 1}DunedinPACE {c |}{res}        470    1.072991    .1408655   .5848409    1.55415
{txt}DNAmAge_Ho~h {c |}{res}        470    48.42491    8.750509   23.61642    71.1201
{txt}DNAmAge_Ha~m {c |}{res}        470    48.70153    10.24755   22.62519   79.30316
{txt}{space 9}AGE {c |}{res}        470    48.70153    8.725696   30.18207   65.15264
{txt}{space 8}dead {c |}{res}      3,720    .2526882    .4346121          0          1
{txt}{hline 13}{c +}{hline 57}
{space 6}ageout {c |}{res}      3,720    62.62654    9.274746   33.91376   82.63655
{txt}{space 9}Age {c |}{res}      3,720    48.26927    9.357168       29.8       66.2
{txt}exam_base_wt {c |}{res}      3,720    72.87783    125.2398          0    1300.03
{txt}
{com}. 
. tab1 Sex Race dead

{res}-> tabulation of Sex  

        {txt}Sex {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      Women {c |}{res}      2,035       54.70       54.70
{txt}        Men {c |}{res}      1,685       45.30      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00

-> tabulation of Race  

       {txt}Race {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      White {c |}{res}      1,522       40.91       40.91
{txt}      AfrAm {c |}{res}      2,198       59.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00

-> tabulation of dead  

       {txt}dead {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      2,780       74.73       74.73
{txt}          1 {c |}{res}        940       25.27      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. 
. foreach var of varlist DunedinPACE DNAmAge_Horvath DNAmAge_Hannum {c -(}
{txt}  2{com}.         histogram `var'
{txt}  3{com}.         graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HANDLS_EPICLOCK\HANDLS_EPICLOCK_HIST`var'", replace
{txt}  4{com}. {c )-}
{txt}(bin={res}21{txt}, start={res}.58484089{txt}, width={res}.04615757{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HANDLS_EPICLOCK\HANDLS_EPICLOCK_HISTDunedinPACE.gph} saved
(bin={res}21{txt}, start={res}23.616417{txt}, width={res}2.2620803{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HANDLS_EPICLOCK\HANDLS_EPICLOCK_HISTDNAmAge_Horvath.gph} saved
(bin={res}21{txt}, start={res}22.625187{txt}, width={res}2.6989511{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HANDLS_EPICLOCK\HANDLS_EPICLOCK_HISTDNAmAge_Hannum.gph} saved

{com}. 
. save, replace 
{txt}{p 0 4 2}
file {bf}
HANDLS_MERGED_DATASET.dta{rm}
saved
{p_end}

{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //STEP 2: GENERATE EPIGENETIC AGE ACCELERATION VARIABLES FROM HORVATH, HANNUM, PHENO, GRIMM, include POA, remove Outliers and z-score//
. 
. capture drop HorvathAge
{txt}
{com}. gen HorvathAge=DNAmAge_Horvath
{txt}(3,250 missing values generated)

{com}. 
. capture drop HannumAge
{txt}
{com}. gen HannumAge=DNAmAge_Hannum
{txt}(3,250 missing values generated)

{com}. 
. capture drop DunedinPoAm
{txt}
{com}. gen DunedinPoAm=DunedinPACE
{txt}(3,250 missing values generated)

{com}. 
. su AGE if HorvathAge~=. & DNAmAge_Hannum~=.

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}AGE {c |}{res}        470    48.70153    8.725696   30.18207   65.15264
{txt}
{com}. histogram AGE if HorvathAge~=. & DNAmAge_Hannum~=. & DunedinPACE~=. 
{txt}(bin={res}21{txt}, start={res}30.18207{txt}, width={res}1.6652652{txt})
{res}{txt}
{com}. 
. capture drop HorvathAgeEAA 
{txt}
{com}. capture drop HannumAgeEAA 
{txt}
{com}. 
. foreach var of varlist HorvathAge HannumAge {c -(}
{txt}  2{com}.         
.         reg `var' AGE 
{txt}  3{com}.         predict `var'EAA, resid
{txt}  4{com}.         histogram `var'EAA
{txt}  5{com}.         graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HANDLS_EPICLOCK\HANDLS_HIST`var'EAA.gph", replace
{txt}  6{com}.         su `var'EAA
{txt}  7{com}. {c )-}

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       470
{txt}{hline 13}{c +}{hline 34}   F(1, 468)       = {res}  1226.32
{txt}       Model {c |} {res} 25992.4912         1  25992.4912   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 9919.49966       468  21.1955121   {txt}R-squared       ={res}    0.7238
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7232
{txt}       Total {c |} {res} 35911.9908       469   76.571409   {txt}Root MSE        =   {res} 4.6039

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  HorvathAge{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}AGE {c |}{col 14}{res}{space 2} .8531737{col 26}{space 2} .0243633{col 37}{space 1}   35.02{col 46}{space 3}0.000{col 54}{space 4} .8052987{col 67}{space 3} .9010486
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  6.87405{col 26}{space 2} 1.205382{col 37}{space 1}    5.70{col 46}{space 3}0.000{col 54}{space 4} 4.505419{col 67}{space 3} 9.242681
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(3,250 missing values generated)
(bin={res}21{txt}, start={res}-14.897246{txt}, width={res}1.3991047{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HANDLS_EPICLOCK\HANDLS_HISTHorvathAgeEAA.gph} saved

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
HorvathAge~A {c |}{res}        470   -1.14e-08    4.598948  -14.89725   14.48395

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       470
{txt}{hline 13}{c +}{hline 34}   F(1, 468)       = {res}  1234.05
{txt}       Model {c |} {res} 35708.6171         1  35708.6171   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 13542.1142       468  28.9361415   {txt}R-squared       ={res}    0.7250
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7244
{txt}       Total {c |} {res} 49250.7313       469   105.01222   {txt}Root MSE        =   {res} 5.3792

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   HannumAge{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}AGE {c |}{col 14}{res}{space 2}        1{col 26}{space 2} .0284665{col 37}{space 1}   35.13{col 46}{space 3}0.000{col 54}{space 4} .9440621{col 67}{space 3} 1.055938
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.12e-07{col 26}{space 2}  1.40839{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-2.767552{col 67}{space 3} 2.767552
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(3,250 missing values generated)
(bin={res}21{txt}, start={res}-20.257854{txt}, width={res}1.7674341{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HANDLS_EPICLOCK\HANDLS_HISTHannumAgeEAA.gph} saved

    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
HannumAgeEAA {c |}{res}        470   -8.91e-09    5.373495  -20.25785   16.85826
{txt}
{com}. 
. su DunedinPoAm

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}DunedinPoAm {c |}{res}        470    1.072991    .1408655   .5848409    1.55415
{txt}
{com}. histogram DunedinPoAm
{txt}(bin={res}21{txt}, start={res}.58484089{txt}, width={res}.04615757{txt})
{res}{txt}
{com}. graph save  "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HANDLS_EPICLOCK\HANDLS_HISTDunedinPoAmEAA.gph", replace
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HANDLS_EPICLOCK\HANDLS_HISTDunedinPoAmEAA.gph} saved

{com}.  
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. 
. *******REMOVE OUTLIERS*************
. 
. local vars HorvathAgeEAA HannumAgeEAA  DunedinPoAm
{txt}
{com}. 
. foreach var of varlist `vars' {c -(}
{txt}  2{com}.     quietly summarize `var', detail
{txt}  3{com}.     local p25 = r(p25)
{txt}  4{com}.     local p75 = r(p75)
{txt}  5{com}.     local iqr = `p75' - `p25'
{txt}  6{com}. 
.     local lower_bound = `p25' - 4 * `iqr'
{txt}  7{com}.     local upper_bound = `p75' + 4 * `iqr'
{txt}  8{com}. 
.     gen `var'_no_outliers = `var'
{txt}  9{com}.     replace `var'_no_outliers = . if `var' < `lower_bound' | `var' > `upper_bound'
{txt} 10{com}. {c )-}
{txt}(3,250 missing values generated)
(0 real changes made)
(3,250 missing values generated)
(0 real changes made)
(3,250 missing values generated)
(0 real changes made)

{com}. 
. 
. 
. 
. *******Z-SCORE*************
. 
. capture drop zHorvathAgeEAA zHannumAgeEAA zDunedinPoAm
{txt}
{com}. foreach var of varlist HorvathAgeEAA_no_outliers HannumAgeEAA_no_outliers DunedinPoAm_no_outliers {c -(}
{txt}  2{com}.         
.         egen z`var'=std(`var')
{txt}  3{com}. {c )-}
{txt}(3,250 missing values generated)
(3,250 missing values generated)
(3,250 missing values generated)

{com}. 
. su z*

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
zHorvathAg~s {c |}{res}        470   -5.81e-10           1  -3.239273   3.149406
{txt}zHannumAge~s {c |}{res}        470    5.62e-10           1  -3.769959   3.137299
{txt}zDunedinPo~s {c |}{res}        470    2.05e-10           1  -3.465367    3.41573
{txt}
{com}. 
. capture rename z*no_outliers z*
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. 
. foreach var of varlist zHorvathAgeEAA zHannumAgeEAA zDunedinPoAm {c -(}
{txt}  2{com}.         histogram `var'
{txt}  3{com}.         graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HANDLS_EPICLOCK\HANDLS_HIST`var'.gph",replace
{txt}  4{com}.         
. {c )-}
{txt}(bin={res}21{txt}, start={res}-3.2392728{txt}, width={res}.30422279{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HANDLS_EPICLOCK\HANDLS_HISTzHorvathAgeEAA_.gph} saved
(bin={res}21{txt}, start={res}-3.769959{txt}, width={res}.32891706{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HANDLS_EPICLOCK\HANDLS_HISTzHannumAgeEAA_.gph} saved
(bin={res}21{txt}, start={res}-3.4653673{txt}, width={res}.32767129{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HANDLS_EPICLOCK\HANDLS_HISTzDunedinPoAm_.gph} saved

{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",clear
{txt}
{com}. 
. 
. //STEP 7: TELOMERE LENGTH///
. 
. 
. **Remove outliers**
. 
. capture drop telomean_no_outliers
{txt}
{com}. gen telomean_no_outliers=tLength
{txt}(3,357 missing values generated)

{com}. 
. local vars telomean 
{txt}
{com}. 
. foreach var of varlist `vars' {c -(}
{txt}  2{com}.     // Calculate IQR
.     quietly summarize `var', detail
{txt}  3{com}.     local p25 = r(p25)
{txt}  4{com}.     local p75 = r(p75)
{txt}  5{com}.     local iqr = `p75' - `p25'
{txt}  6{com}. 
.     // Define the upper and lower bounds for outliers
.     local lower_bound = `p25' - 4 * `iqr'
{txt}  7{com}.     local upper_bound = `p75' + 4 * `iqr'
{txt}  8{com}. 
.     // Generate a new variable excluding outliers
.     gen `var'_no_outliers = `var'
{txt}  9{com}.     replace `var'_no_outliers = . if `var' < `lower_bound' | `var' > `upper_bound'
{txt} 10{com}. {c )-}
{txt}(3,357 missing values generated)
(0 real changes made)

{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
{txt}end of do-file

{com}. su telomean_no_outliers_no_outliers

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
telomean_n.. {c |}{res}        363    5.643691    .7191236        2.6        8.5

{com}. do "C:\Users\baydounm\AppData\Local\Temp\STD278_000000.tmp"
{txt}
{com}. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",clear
{txt}
{com}. 
. 
. **Z-scoring**
. 
. 
. 
. capture drop ztelomean_no_outliers
{txt}
{com}. foreach var of varlist telomean_no_outliers  {c -(}
{txt}  2{com}.         
.         egen z`var'=std(`var')
{txt}  3{com}. {c )-}
{txt}(3,357 missing values generated)

{com}. 
. su z*

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
zHorvathAg~_ {c |}{res}        470   -5.81e-10           1  -3.239273   3.149406
{txt}zHannumAge~_ {c |}{res}        470    5.62e-10           1  -3.769959   3.137299
{txt}zDunedinPo~_ {c |}{res}        470    2.05e-10           1  -3.465367    3.41573
{txt}ztelomean_~s {c |}{res}        363    7.43e-10           1  -4.232501    3.97193
{txt}
{com}. 
. 
. foreach var of varlist ztelomean_no_outliers {c -(}
{txt}  2{com}.         histogram `var'
{txt}  3{com}.         graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HANDLS_TELOMERES\HANDLS_HIST`var'.gph",replace
{txt}  4{com}.         
. {c )-}
{txt}(bin={res}19{txt}, start={res}-4.232501{txt}, width={res}.43181215{txt})
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HANDLS_TELOMERES\HANDLS_HISTztelomean_no_outliers.gph} saved

{com}. 
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",clear
{txt}
{com}. 
. 
. //STEP 8: COVARIATES//
. 
. 
. **RACE**
. 
. capture drop RACE
{txt}
{com}. gen RACE=.
{txt}(3,720 missing values generated)

{com}. replace RACE=1 if Race==2
{txt}(2,198 real changes made)

{com}. replace RACE=0 if Race==1
{txt}(1,522 real changes made)

{com}. 
. tab RACE

       {txt}RACE {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,522       40.91       40.91
{txt}          1 {c |}{res}      2,198       59.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. **SEX**
. 
. tab Sex

        {txt}Sex {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      Women {c |}{res}      2,035       54.70       54.70
{txt}        Men {c |}{res}      1,685       45.30      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. capture drop SEX
{txt}
{com}. gen SEX=.
{txt}(3,720 missing values generated)

{com}. replace SEX=1 if Sex==1
{txt}(2,035 real changes made)

{com}. replace SEX=0 if Sex==2
{txt}(1,685 real changes made)

{com}. 
. **SEX
. **0: Male
. **1: Female
. 
. tab SEX

        {txt}SEX {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,685       45.30       45.30
{txt}          1 {c |}{res}      2,035       54.70      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. **COHORT VARIABLE**
. 
. capture drop COHORT
{txt}
{com}. gen COHORT=3
{txt}
{com}. 
. tab COHORT

     {txt}COHORT {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          3 {c |}{res}      3,720      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. capture drop telomean_no_outliers_no_outliers
{txt}
{com}. 
. capture rename  zHorvathAgeEAA_ zHorvathAgeEAA
{txt}
{com}. 
. capture rename zHannumAgeEAA_ zHannumAgeEAA
{txt}
{com}. 
. capture rename zDunedinPoAm_ zDunedinPoAm
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",clear
{txt}
{com}. 
. 
. 
. //STEP 9: SET UP DATASET AS SURVIVAL DATA//
. 
. 
. **Age at death**
. capture drop Age_follow
{txt}
{com}. gen  Age_follow=ageout
{txt}
{com}. 
. su Age_follow,det

                         {txt}Age_follow
{hline 61}
      Percentiles      Smallest
 1%    {res} 44.85968       33.91376
{txt} 5%    {res} 47.58111       34.12731
{txt}10%    {res} 50.04517       34.45311       {txt}Obs         {res}      3,720
{txt}25%    {res} 55.38125       34.49966       {txt}Sum of wgt. {res}      3,720

{txt}50%    {res} 62.83915                      {txt}Mean          {res} 62.62654
                        {txt}Largest       Std. dev.     {res} 9.274746
{txt}75%    {res} 69.88912       82.58453
{txt}90%    {res} 75.06366       82.58727       {txt}Variance      {res} 86.02091
{txt}95%    {res} 77.88638       82.60096       {txt}Skewness      {res}-.0552172
{txt}99%    {res} 80.45996       82.63655       {txt}Kurtosis      {res} 2.232437
{txt}
{com}. histogram Age_follow
{txt}(bin={res}35{txt}, start={res}33.913757{txt}, width={res}1.3920798{txt})
{res}{txt}
{com}. 
. **Died**
. capture drop DIED
{txt}
{com}. gen DIED=1 if dead==1
{txt}(2,780 missing values generated)

{com}. replace DIED=0 if dead==0
{txt}(2,780 real changes made)

{com}. 
. tab DIED

       {txt}DIED {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      2,780       74.73       74.73
{txt}          1 {c |}{res}        940       25.27      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. **Demographics**
. tab Sex

        {txt}Sex {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      Women {c |}{res}      2,035       54.70       54.70
{txt}        Men {c |}{res}      1,685       45.30      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. tab Race

       {txt}Race {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      White {c |}{res}      1,522       40.91       40.91
{txt}      AfrAm {c |}{res}      2,198       59.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. su Age

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}Age {c |}{res}      3,720    48.26927    9.357168       29.8       66.2
{txt}
{com}. 
. 
. **Time of follow-up in years**
. capture drop TIMEyears
{txt}
{com}. gen TIMEyears=Age_follow-Age
{txt}
{com}. 
. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. stset TIMEyears [pweight=exam_base_wt], id(HNDID) failure(DIED==1)

{txt}Survival-time data settings

{col 12}ID variable: {res}HNDID
{col 10}{txt}Failure event: {res}DIED==1
{col 1}{txt}Observed time interval: {res}(TIMEyears[_n-1], TIMEyears]
{col 6}{txt}Exit on or before: {res}failure
{col 17}{txt}Weight: {res}[pweight=exam_base_wt]

{txt}{hline 74}
{res}      3,720{txt}  total observations
{res}        918{txt}  weights invalid {col 61}PROBABLE ERROR
{hline 74}
{res}      2,802{txt}  observations remaining, representing
{res}      2,802{txt}  subjects
{res}        715{txt}  failures in single-failure-per-subject data
{res}   40,239.7{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res}        0
                                          {txt}Last observed exit t = {res} 18.39103
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\baydounm\AppData\Local\Temp\STD278_000000.tmp"
{txt}
{com}. 
. //STEP 10: STUDY SAMPLE SELECTION STEP, INVERSE MILLS RATIO, USING AGE>=50Y RESTRICTION//
. 
. **LARGEST HANDLS SAMPLE**
. 
. capture drop sample1
{txt}
{com}. gen sample1=.
{txt}(3,720 missing values generated)

{com}. replace sample1=1 if Age~=.
{txt}(3,720 real changes made)

{com}. replace sample1=0 if sample1~=1
{txt}(0 real changes made)

{com}. 
. tab sample1   

    {txt}sample1 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      3,720      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. **TELOMERE LENGTH DATA AVAILABLE**
. 
. capture drop sample2
{txt}
{com}. gen sample2=.
{txt}(3,720 missing values generated)

{com}. replace sample2=1 if ztelomean_no_outliers~=.
{txt}(363 real changes made)

{com}. replace sample2=0 if sample2~=1
{txt}(3,357 real changes made)

{com}. 
. tab sample2  

    {txt}sample2 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,357       90.24       90.24
{txt}          1 {c |}{res}        363        9.76      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. 
. **EPIGENETIC CLOCK DATA AVAILABLE**
. 
. capture drop sample3
{txt}
{com}. gen sample3=.
{txt}(3,720 missing values generated)

{com}. replace sample3=1 if zHorvathAgeEAA~=. & zHannumAgeEAA~=. & zDunedinPoAm~=.
{txt}(470 real changes made)

{com}. replace sample3=0 if sample3~=1
{txt}(3,250 real changes made)

{com}. 
. tab sample3  

    {txt}sample3 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,250       87.37       87.37
{txt}          1 {c |}{res}        470       12.63      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. **TELOMERE LENGTH and EPIGENETIC CLOCK DATA AVAILABLE **
. 
. 
. capture drop sample4
{txt}
{com}. gen sample4=.
{txt}(3,720 missing values generated)

{com}. replace sample4=1 if sample3==1 & sample2==1
{txt}(92 real changes made)

{com}. replace sample4=0 if sample4~=1
{txt}(3,628 real changes made)

{com}. 
. tab sample4

    {txt}sample4 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,628       97.53       97.53
{txt}          1 {c |}{res}         92        2.47      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. 
. capture drop sample_final
{txt}
{com}. gen sample_final=sample4
{txt}
{com}. 
. 
. tab sample_final

{txt}sample_fina {c |}
          l {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,628       97.53       97.53
{txt}          1 {c |}{res}         92        2.47      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,720      100.00
{txt}
{com}. 
. **Inverse mills ratio**
. 
. xi:probit sample_final Age SEX i.RACE
{txt}i.RACE{col 19}_IRACE_0-1{col 39}(naturally coded; _IRACE_0 omitted)

{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-431.22438}  
Iteration 1:{space 2}Log likelihood = {res:-408.88462}  
Iteration 2:{space 2}Log likelihood = {res:-408.02286}  
Iteration 3:{space 2}Log likelihood = {res: -408.0207}  
Iteration 4:{space 2}Log likelihood = {res: -408.0207}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:3,720}
{txt}{col 57}{lalign 13:LR chi2({res:3})}{col 70} = {res}{ralign 6:46.41}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 9:-408.0207}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0538}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sample_final{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}Age {c |}{col 14}{res}{space 2} .0039833{col 26}{space 2} .0049855{col 37}{space 1}    0.80{col 46}{space 3}0.424{col 54}{space 4}-.0057882{col 67}{space 3} .0137548
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.2743202{col 26}{space 2} .0918019{col 37}{space 1}   -2.99{col 46}{space 3}0.003{col 54}{space 4}-.4542486{col 67}{space 3}-.0943919
{txt}{space 4}_IRACE_1 {c |}{col 14}{res}{space 2}-.5515454{col 26}{space 2} .0945342{col 37}{space 1}   -5.83{col 46}{space 3}0.000{col 54}{space 4}-.7368289{col 67}{space 3}-.3662618
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.773639{col 26}{space 2} .2536015{col 37}{space 1}   -6.99{col 46}{space 3}0.000{col 54}{space 4}-2.270689{col 67}{space 3}-1.276589
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. capture drop p1fin
{txt}
{com}. predict p1fin, xb
{txt}
{com}. 
. capture drop phifin
{txt}
{com}. capture drop caphifin
{txt}
{com}. capture drop invmillsfin
{txt}
{com}. 
. gen phifin=(1/sqrt(2*_pi))*exp(-(p1fin^2/2))
{txt}
{com}. 
. egen caphifin=std(p1fin)
{txt}
{com}. 
. capture drop invmillsfin
{txt}
{com}. gen invmillsfin=phifin/caphifin
{txt}
{com}. 
. 
. su invmillsfin

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}invmillsfin {c |}{res}      3,720   -.0338339    .1841988  -2.927726   .1474334
{txt}
{com}. histogram invmillsfin
{txt}(bin={res}35{txt}, start={res}-2.9277263{txt}, width={res}.0878617{txt})
{res}{txt}
{com}. 
. 
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HANDLS\HANDLS_MERGED_DATASETfin.dta{rm}
saved
{p_end}

{com}. 
. 
{txt}end of do-file

{com}. do "C:\Users\baydounm\AppData\Local\Temp\STD278_000000.tmp"
{txt}
{com}. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}