{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT.dta",clear
{txt}
{com}. 
. 
. 
. **STEP 12: FIGURE 1: K-M CURVES BY TERTLES**
. 
. 
. 
. capture drop zHorvathAgeEAA
{txt}
{com}. capture drop zHannumAgeEAA 
{txt}
{com}. capture drop zPhenoAgeEAA
{txt}
{com}. capture drop zGrimAgeMortEAA 
{txt}
{com}. capture drop zDunedinPoAm
{txt}
{com}. capture drop ztelomean_no_outliers
{txt}
{com}. 
. gen zHorvathAgeEAA=zHORVATH_DNAMAGE_no_outliersEAA
{txt}(45,822 missing values generated)

{com}. gen zHannumAgeEAA=zHANNUM_DNAMAGE_no_outliersEAA
{txt}(45,822 missing values generated)

{com}. gen zPhenoAgeEAA=zLEVINE_DNAMAGE_no_outliersEAA
{txt}(45,822 missing values generated)

{com}. gen zGrimAgeMortEAA=zDNAMGRIMAGE_no_outliersEAA
{txt}(45,822 missing values generated)

{com}. gen zDunedinPoAm=zMPOA_no_outliers
{txt}(45,822 missing values generated)

{com}. gen ztelomean_no_outliers=zFINAL_T_S_no_outliers
{txt}(45,822 missing values generated)

{com}. 
. capture drop zHorvathAgeEAAtert 
{txt}
{com}. capture drop zHannumAgeEAAtert 
{txt}
{com}. capture drop zPhenoAgeEAAtert
{txt}
{com}. capture drop zGrimAgeMortEAAtert 
{txt}
{com}. capture drop zDunedinPoAmtert 
{txt}
{com}. capture drop ztelomean_no_outlierstert
{txt}
{com}. 
. 
. 
. foreach var of varlist zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm ztelomean_no_outliers {c -(}
{txt}  2{com}.         xtile `var'tert=`var' if sample_final==1,nq(3)
{txt}  3{com}. 
. {c )-}
{txt}
{com}. 
. 
. tab1 *tert 

{res}-> tabulation of zHorvathAgeEAAtert  

{txt}3 quantiles {c |}
         of {c |}
zHorvathAge {c |}
       EAA  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        343       33.33       33.33
{txt}          2 {c |}{res}        343       33.33       66.67
{txt}          3 {c |}{res}        343       33.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,029      100.00

-> tabulation of zHannumAgeEAAtert  

{txt}3 quantiles {c |}
         of {c |}
zHannumAgeE {c |}
        AA  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        343       33.33       33.33
{txt}          2 {c |}{res}        343       33.33       66.67
{txt}          3 {c |}{res}        343       33.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,029      100.00

-> tabulation of zPhenoAgeEAAtert  

{txt}3 quantiles {c |}
         of {c |}
zPhenoAgeEA {c |}
         A  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        343       33.33       33.33
{txt}          2 {c |}{res}        343       33.33       66.67
{txt}          3 {c |}{res}        343       33.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,029      100.00

-> tabulation of zGrimAgeMortEAAtert  

{txt}3 quantiles {c |}
         of {c |}
zGrimAgeMor {c |}
      tEAA  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        343       33.33       33.33
{txt}          2 {c |}{res}        343       33.33       66.67
{txt}          3 {c |}{res}        343       33.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,029      100.00

-> tabulation of zDunedinPoAmtert  

{txt}3 quantiles {c |}
         of {c |}
zDunedinPoA {c |}
         m  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        343       33.33       33.33
{txt}          2 {c |}{res}        343       33.33       66.67
{txt}          3 {c |}{res}        343       33.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,029      100.00

-> tabulation of ztelomean_no_outlierstert  

{txt}3 quantiles {c |}
         of {c |}
ztelomean_n {c |}
o_outliers  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        343       33.33       33.33
{txt}          2 {c |}{res}        343       33.33       66.67
{txt}          3 {c |}{res}        343       33.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,029      100.00
{txt}
{com}. 
. 
. foreach var of varlist *tert {c -(}
{txt}  2{com}.         sts test `var' if sample_final==1  
{txt}  3{com}. {c )-}
{txt}note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}time_event
{col 13}{txt}Weight: {res}[pweight=vbsi16wgtra]

{txt}Equality of survivor functions
Cox regression-based test

{col 13} {c |}  Observed       Expected     Relative
zHorvathAg~t {c |}    events         events       hazard
{hline 13}{c +}{hline 38}
           1 {c |}{res}1653162.00     1526997.74       1.0999
           {txt}2 {c |}{res}1273450.00     1650827.54       0.7836
           {txt}3 {c |}{res}1797153.00     1545939.72       1.1810
{txt}{hline 13}{c +}{hline 38}
       Total {c |}{res}4723765.00     4723765.00       1.0000

                               {txt}Wald chi2(2) =   {res}5.27
                               {txt}Pr>chi2      = {res}0.0717

{txt}{p 0 6 2 55}Note: Reporting Wald model test from Cox regression on {bf:zHorvathAgeEAAtert}.{p_end}
note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}time_event
{col 13}{txt}Weight: {res}[pweight=vbsi16wgtra]

{txt}Equality of survivor functions
Cox regression-based test

{col 13} {c |}  Observed       Expected     Relative
zHannumAge~t {c |}    events         events       hazard
{hline 13}{c +}{hline 38}
           1 {c |}{res}1317501.00     1626432.72       0.8284
           {txt}2 {c |}{res}1426567.00     1595625.12       0.9144
           {txt}3 {c |}{res}1979697.00     1501707.16       1.3484
{txt}{hline 13}{c +}{hline 38}
       Total {c |}{res}4723765.00     4723765.00       1.0000

                               {txt}Wald chi2(2) =   {res}8.55
                               {txt}Pr>chi2      = {res}0.0139

{txt}{p 0 6 2 55}Note: Reporting Wald model test from Cox regression on {bf:zHannumAgeEAAtert}.{p_end}
note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}time_event
{col 13}{txt}Weight: {res}[pweight=vbsi16wgtra]

{txt}Equality of survivor functions
Cox regression-based test

{col 13} {c |}  Observed       Expected     Relative
zPhenoAgeE~t {c |}    events         events       hazard
{hline 13}{c +}{hline 38}
           1 {c |}{res}1268873.00     1663752.68       0.7892
           {txt}2 {c |}{res}1426857.00     1617847.15       0.9128
           {txt}3 {c |}{res}2028035.00     1442165.17       1.4557
{txt}{hline 13}{c +}{hline 38}
       Total {c |}{res}4723765.00     4723765.00       1.0000

                               {txt}Wald chi2(2) =  {res}13.77
                               {txt}Pr>chi2      = {res}0.0010

{txt}{p 0 6 2 55}Note: Reporting Wald model test from Cox regression on {bf:zPhenoAgeEAAtert}.{p_end}
note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}time_event
{col 13}{txt}Weight: {res}[pweight=vbsi16wgtra]

{txt}Equality of survivor functions
Cox regression-based test

{col 13} {c |}  Observed       Expected     Relative
zGrimAgeMo~t {c |}    events         events       hazard
{hline 13}{c +}{hline 38}
           1 {c |}{res} 990280.00     1847001.31       0.5931
           {txt}2 {c |}{res}1637061.00     1593550.93       1.1369
           {txt}3 {c |}{res}2096424.00     1283212.76       1.8088
{txt}{hline 13}{c +}{hline 38}
       Total {c |}{res}4723765.00     4723765.00       1.0000

                               {txt}Wald chi2(2) =  {res}32.75
                               {txt}Pr>chi2      = {res}0.0000

{txt}{p 0 6 2 55}Note: Reporting Wald model test from Cox regression on {bf:zGrimAgeMortEAAtert}.{p_end}
note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}time_event
{col 13}{txt}Weight: {res}[pweight=vbsi16wgtra]

{txt}Equality of survivor functions
Cox regression-based test

{col 13} {c |}  Observed       Expected     Relative
zDunedinPo~t {c |}    events         events       hazard
{hline 13}{c +}{hline 38}
           1 {c |}{res}1178085.00     1794611.68       0.6930
           {txt}2 {c |}{res}1509318.00     1545040.65       1.0316
           {txt}3 {c |}{res}2036362.00     1384112.67       1.5539
{txt}{hline 13}{c +}{hline 38}
       Total {c |}{res}4723765.00     4723765.00       1.0000

                               {txt}Wald chi2(2) =  {res}18.55
                               {txt}Pr>chi2      = {res}0.0001

{txt}{p 0 6 2 55}Note: Reporting Wald model test from Cox regression on {bf:zDunedinPoAmtert}.{p_end}
note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}time_event
{col 13}{txt}Weight: {res}[pweight=vbsi16wgtra]

{txt}Equality of survivor functions
Cox regression-based test

{col 13} {c |}  Observed       Expected     Relative
ztelomean_~t {c |}    events         events       hazard
{hline 13}{c +}{hline 38}
           1 {c |}{res}1963970.00     1550935.52       1.2871
           {txt}2 {c |}{res}1379527.00     1577092.18       0.8890
           {txt}3 {c |}{res}1380268.00     1595737.30       0.8790
{txt}{hline 13}{c +}{hline 38}
       Total {c |}{res}4723765.00     4723765.00       1.0000

                               {txt}Wald chi2(2) =   {res}6.39
                               {txt}Pr>chi2      = {res}0.0411

{txt}{p 0 6 2 55}Note: Reporting Wald model test from Cox regression on {bf:ztelomean_no_outlierstert}.{p_end}

{com}. 
. 
. foreach var of varlist *tert {c -(}
{txt}  2{com}.         sts graph if sample_final==1 , by(`var')
{txt}  3{com}. graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_FIGURE1_KM\FIGURE1`var'.gph",replace
{txt}  4{com}. {c )-} 

{col 9}{txt}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}time_event
{col 13}{txt}Weight: {res}[pweight=vbsi16wgtra]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_FIGURE1_KM\FIGURE1zHorvathAgeEAAtert.gph} saved

{col 9}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}time_event
{col 13}{txt}Weight: {res}[pweight=vbsi16wgtra]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_FIGURE1_KM\FIGURE1zHannumAgeEAAtert.gph} saved

{col 9}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}time_event
{col 13}{txt}Weight: {res}[pweight=vbsi16wgtra]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_FIGURE1_KM\FIGURE1zPhenoAgeEAAtert.gph} saved

{col 9}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}time_event
{col 13}{txt}Weight: {res}[pweight=vbsi16wgtra]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_FIGURE1_KM\FIGURE1zGrimAgeMortEAAtert.gph} saved

{col 9}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}time_event
{col 13}{txt}Weight: {res}[pweight=vbsi16wgtra]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_FIGURE1_KM\FIGURE1zDunedinPoAmtert.gph} saved

{col 9}Failure {bf:_d}: {res}died==1
{col 3}{txt}Analysis time {bf:_t}: {res}time_event
{col 13}{txt}Weight: {res}[pweight=vbsi16wgtra]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_FIGURE1_KM\FIGURE1ztelomean_no_outlierstert.gph} saved

{com}. 
. graph combine "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_FIGURE1_KM\FIGURE1zHorvathAgeEAAtert.gph" ///
> "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_FIGURE1_KM\FIGURE1zDunedinPoAmtert.gph" ////
> "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_FIGURE1_KM\FIGURE1zGrimAgeMortEAAtert.gph"  ///
> "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_FIGURE1_KM\FIGURE1zHannumAgeEAAtert.gph"  ///
> "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_FIGURE1_KM\FIGURE1zPhenoAgeEAAtert.gph"  ///
> "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_FIGURE1_KM\FIGURE1ztelomean_no_outlierstert.gph"
{res}{txt}
{com}. 
. graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_FIGURE1_KM\FIGURE1combined.gph",replace
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\HRS_FIGURE1_KM\FIGURE1combined.gph} saved

{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT.dta",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT.dta{rm}
saved
{p_end}

{com}. 
. 
{txt}end of do-file

{com}. do "C:\Users\baydounm\AppData\Local\Temp\STD3324_000000.tmp"
{txt}
{com}. 
. capture log close
{smcl}
{com}{sf}{ul off}