{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. //STEP 17: GENERATE DATASET WITH DISCRETE TIME HAZARDS: 2 YR INTERVALS: FRIDAY PLUS CORRECT FIGURES USING SAMPLING WEIGHTS (K-M and Error bar) //
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT_ABN_SMALL",clear
{txt}
{com}. 
. sort HHIDPN
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT_ABN_SMALL",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT_ABN_SMALL.dta{rm}
saved
{p_end}

{com}. 
. 
. * Step 1: Expand the dataset
. capture drop period
{txt}
{com}. gen period = floor(_t / 2) + 1  // Create time periods based on 2-year intervals
{txt}
{com}. expand period  // Expand the dataset for each time period
{txt}(2,643 observations created)

{com}. 
. * Step 2: Create time variables for analysis
. capture drop start_time
{txt}
{com}. capture drop end_time
{txt}
{com}. 
. bysort HHIDPN: gen start_time = (_n - 1) * 2  // Start of each 2-year period
{txt}
{com}. bysort HHIDPN: gen end_time = start_time + 2  // End of each 2-year period
{txt}
{com}. 
. * Step 3: Indicate event occurrence in each period
. capture drop event
{txt}
{com}. 
. gen event = (_d == 1 & _t <= end_time & _t > start_time)
{txt}
{com}. 
. * Step 4: Create dummy variables for each 2-year interval
. gen interval = floor(start_time / 2) + 1  // Create interval number
{txt}
{com}. tabulate interval, generate(dummy)  // Generate dummy variables for each interval

   {txt}interval {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      1,028       28.00       28.00
{txt}          2 {c |}{res}        981       26.72       54.73
{txt}          3 {c |}{res}        890       24.24       78.97
{txt}          4 {c |}{res}        772       21.03      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,671      100.00
{txt}
{com}. 
. 
. logistic _d dummy1-dummy4 AGE SEX NHB HISP OTHER zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm ztelomean_no_outliers  
{txt}note: {bf:dummy4} omitted because of collinearity.
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:3,671}
{txt}{col 57}{lalign 13:LR chi2({res:14})}{col 70} = {res}{ralign 6:857.84}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 9:-1310.964}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.2465}

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                   _d{col 23}{c |} Odds ratio{col 35}   Std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}dummy1 {c |}{col 23}{res}{space 2} 8.565259{col 35}{space 2} 1.794692{col 46}{space 1}   10.25{col 55}{space 3}0.000{col 63}{space 4} 5.680505{col 76}{space 3} 12.91499
{txt}{space 15}dummy2 {c |}{col 23}{res}{space 2} 7.174399{col 35}{space 2} 1.517007{col 46}{space 1}    9.32{col 55}{space 3}0.000{col 63}{space 4} 4.740251{col 76}{space 3}  10.8585
{txt}{space 15}dummy3 {c |}{col 23}{res}{space 2}  4.43557{col 35}{space 2} .9698222{col 46}{space 1}    6.81{col 55}{space 3}0.000{col 63}{space 4} 2.889596{col 76}{space 3} 6.808662
{txt}{space 15}dummy4 {c |}{col 23}{res}{space 2}        1{col 35}{txt}  (omitted)
{space 18}AGE {c |}{col 23}{res}{space 2} 1.151891{col 35}{space 2} .0083106{col 46}{space 1}   19.60{col 55}{space 3}0.000{col 63}{space 4} 1.135717{col 76}{space 3} 1.168295
{txt}{space 18}SEX {c |}{col 23}{res}{space 2} 1.356112{col 35}{space 2} .1517988{col 46}{space 1}    2.72{col 55}{space 3}0.007{col 63}{space 4} 1.088967{col 76}{space 3} 1.688792
{txt}{space 18}NHB {c |}{col 23}{res}{space 2} .9824412{col 35}{space 2} .1664485{col 46}{space 1}   -0.10{col 55}{space 3}0.917{col 63}{space 4} .7048442{col 76}{space 3} 1.369367
{txt}{space 17}HISP {c |}{col 23}{res}{space 2} .6614152{col 35}{space 2} .1189514{col 46}{space 1}   -2.30{col 55}{space 3}0.022{col 63}{space 4} .4649336{col 76}{space 3} .9409302
{txt}{space 16}OTHER {c |}{col 23}{res}{space 2}  .803623{col 35}{space 2} .3482869{col 46}{space 1}   -0.50{col 55}{space 3}0.614{col 63}{space 4} .3436728{col 76}{space 3} 1.879142
{txt}{space 7}zHorvathAgeEAA {c |}{col 23}{res}{space 2} .9195584{col 35}{space 2} .0501481{col 46}{space 1}   -1.54{col 55}{space 3}0.124{col 63}{space 4} .8263406{col 76}{space 3} 1.023292
{txt}{space 8}zHannumAgeEAA {c |}{col 23}{res}{space 2} 1.110604{col 35}{space 2} .0660735{col 46}{space 1}    1.76{col 55}{space 3}0.078{col 63}{space 4} .9883679{col 76}{space 3} 1.247959
{txt}{space 9}zPhenoAgeEAA {c |}{col 23}{res}{space 2} 1.223524{col 35}{space 2} .0707749{col 46}{space 1}    3.49{col 55}{space 3}0.000{col 63}{space 4} 1.092382{col 76}{space 3} 1.370409
{txt}{space 6}zGrimAgeMortEAA {c |}{col 23}{res}{space 2} 1.600594{col 35}{space 2} .1172992{col 46}{space 1}    6.42{col 55}{space 3}0.000{col 63}{space 4}  1.38644{col 76}{space 3} 1.847827
{txt}{space 9}zDunedinPoAm {c |}{col 23}{res}{space 2} .9923333{col 35}{space 2} .0640189{col 46}{space 1}   -0.12{col 55}{space 3}0.905{col 63}{space 4} .8744673{col 76}{space 3} 1.126086
{txt}ztelomean_no_outliers {c |}{col 23}{res}{space 2} .9049081{col 35}{space 2} .0469745{col 46}{space 1}   -1.92{col 55}{space 3}0.054{col 63}{space 4} .8173686{col 76}{space 3} 1.001823
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 7.03e-07{col 35}{space 2} 4.34e-07{col 46}{space 1}  -22.96{col 55}{space 3}0.000{col 63}{space 4} 2.10e-07{col 76}{space 3} 2.36e-06
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. 
. sort HHIDPN 
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT_ABN__DISCRETE",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT_ABN__DISCRETE.dta{rm}
saved
{p_end}

{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT_ABN__DISCRETE",clear
{txt}
{com}. 
. capture rename _d d_var
{txt}
{com}. 
. 
. keep AGE SEX NHB HISP OTHER d_var dummy* zHorvathAgeEAA-ztelomean_no_outliers
{txt}
{com}. 
. destring(AGE),replace
{txt}AGE already numeric; no {res}replace
{txt}
{com}. 
. capture rename ztelomean_no_outliers ztelomean_clean
{txt}
{com}. 
. order AGE zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm ztelomean_clean SEX d_var NHB HISP OTHER dummy1 dummy2 dummy3 dummy4
{txt}
{com}. 
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT_ABN_DISCRETEfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\HRS\HRS_TLEPIGENMORT_ABN_DISCRETEfin.dta{rm}
saved
{p_end}

{com}. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}