{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. 
. 
. //STEP 16: DISCRETIZE VARIABLES FOR ABN ANALYSIS AND GENERATE DATASET FOR R; CREATE A VARIABLE COHORT=1 (NHANES)//
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET",clear
{txt}
{com}. 
. keep if sample_final==1
{txt}(18,482 observations deleted)

{com}. 
. keep seqn  AGE SEX RACE zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm ztelomean_no_outliers  ztelostd_no_outliers _st _d _t _t0 COHORT
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. **AGE**
. capture drop AGEbr
{txt}
{com}. xtile AGEbr = AGE, nq(100)
{txt}
{com}. bysort AGEbr: egen AGE_median = median(AGE)
{txt}
{com}. replace AGE_median = round(AGE_median, 0.01)
{txt}(0 real changes made)

{com}. replace AGE = AGE_median
{txt}(0 real changes made)

{com}. histogram AGE
{txt}(bin={res}34{txt}, start={res}50{txt}, width={res}1.0294118{txt})
{res}{txt}
{com}. tab AGE

        {txt}AGE {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         50 {c |}{res}         74        2.93        2.93
{txt}         51 {c |}{res}         91        3.61        6.54
{txt}         52 {c |}{res}         92        3.65       10.19
{txt}         53 {c |}{res}         78        3.09       13.28
{txt}         54 {c |}{res}         81        3.21       16.49
{txt}         55 {c |}{res}         62        2.46       18.95
{txt}         56 {c |}{res}         67        2.66       21.61
{txt}         57 {c |}{res}         56        2.22       23.83
{txt}         58 {c |}{res}         46        1.82       25.65
{txt}         59 {c |}{res}         45        1.78       27.44
{txt}         60 {c |}{res}        109        4.32       31.76
{txt}         61 {c |}{res}         99        3.93       35.69
{txt}         62 {c |}{res}        116        4.60       40.29
{txt}         63 {c |}{res}         87        3.45       43.74
{txt}         64 {c |}{res}         89        3.53       47.26
{txt}         65 {c |}{res}         85        3.37       50.63
{txt}         66 {c |}{res}         87        3.45       54.08
{txt}         67 {c |}{res}         77        3.05       57.14
{txt}         68 {c |}{res}         82        3.25       60.39
{txt}         69 {c |}{res}         65        2.58       62.97
{txt}         70 {c |}{res}         88        3.49       66.46
{txt}         71 {c |}{res}         77        3.05       69.51
{txt}         72 {c |}{res}         70        2.78       72.28
{txt}         73 {c |}{res}         66        2.62       74.90
{txt}         74 {c |}{res}         58        2.30       77.20
{txt}         75 {c |}{res}         55        2.18       79.38
{txt}         76 {c |}{res}         50        1.98       81.36
{txt}         77 {c |}{res}         53        2.10       83.47
{txt}         78 {c |}{res}         45        1.78       85.25
{txt}         79 {c |}{res}         32        1.27       86.52
{txt}         80 {c |}{res}         53        2.10       88.62
{txt}         81 {c |}{res}         56        2.22       90.84
{txt}         82 {c |}{res}         46        1.82       92.66
{txt}         83 {c |}{res}         22        0.87       93.54
{txt}         84 {c |}{res}         33        1.31       94.85
{txt}         85 {c |}{res}        130        5.15      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00
{txt}
{com}. 
. **SEX***
. tab SEX

        {txt}SEX {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      1,281       50.79       50.79
{txt}          2 {c |}{res}      1,241       49.21      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00
{txt}
{com}. recode SEX (1=0) (2=1)
{txt}(2,522 changes made to {bf:SEX})

{com}. 
. tab SEX

        {txt}SEX {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,281       50.79       50.79
{txt}          1 {c |}{res}      1,241       49.21      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00
{txt}
{com}. 
. 
. **NonWhite RACES**
. 
. **Non-Hispanic Black**
. 
. capture drop NHB
{txt}
{com}. gen NHB=.
{txt}(2,522 missing values generated)

{com}. replace NHB=1 if RACE==1
{txt}(536 real changes made)

{com}. replace NHB=0 if RACE~=. & NHB~=1
{txt}(1,986 real changes made)

{com}. 
. tab NHB

        {txt}NHB {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,986       78.75       78.75
{txt}          1 {c |}{res}        536       21.25      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00
{txt}
{com}. 
. **Hispanic**
. capture drop HISP
{txt}
{com}. gen HISP=.
{txt}(2,522 missing values generated)

{com}. replace HISP=1 if RACE==2
{txt}(880 real changes made)

{com}. replace HISP=0 if RACE~=. & HISP~=1
{txt}(1,642 real changes made)

{com}. 
. tab HISP

       {txt}HISP {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,642       65.11       65.11
{txt}          1 {c |}{res}        880       34.89      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00
{txt}
{com}. 
. **Other**
. capture drop OTHER
{txt}
{com}. gen OTHER=.
{txt}(2,522 missing values generated)

{com}. replace OTHER=1 if RACE==3
{txt}(82 real changes made)

{com}. replace OTHER=0 if RACE~=. & OTHER~=1
{txt}(2,440 real changes made)

{com}. 
. tab OTHER

      {txt}OTHER {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      2,440       96.75       96.75
{txt}          1 {c |}{res}         82        3.25      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00
{txt}
{com}. 
. 
. 
. *EPIGENETIC CLOCKS AND TELOMERE LENGHTS*
. 
. foreach x of varlist zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm ztelomean_no_outliers    {c -(}
{txt}  2{com}.         egen z`x'=std(`x') if sample_final==1
{txt}  3{com}. {c )-}
{err}sample_final not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\baydounm\AppData\Local\Temp\STD6994_000000.tmp"
{txt}
{com}. 
. *EPIGENETIC CLOCKS AND TELOMERE LENGHTS*
. 
. capture drop zz*
{txt}
{com}. foreach x of varlist zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm ztelomean_no_outliers    {c -(}
{txt}  2{com}.         egen z`x'=std(`x')
{txt}  3{com}. {c )-}
{txt}
{com}. 
. capture rename zz* z*
{txt}
{com}. 
. 
. foreach x of varlist zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm ztelomean_no_outliers    {c -(}
{txt}  2{com}. capture drop `x'br
{txt}  3{com}. xtile `x'br = `x', nq(100)
{txt}  4{com}. bysort `x'br: egen `x'_median = median(`x')
{txt}  5{com}. replace `x'_median = round(`x'_median, 0.01)
{txt}  6{com}. replace `x' = `x'_median
{txt}  7{com}. histogram `x' 
{txt}  8{com}. tab `x'
{txt}  9{com}. 
. {c )-}
{txt}(2,522 real changes made)
(2,522 real changes made)
(bin={res}34{txt}, start={res}-3.9400001{txt}, width={res}.20764706{txt})
{res}
{txt}Standardize {c |}
d values of {c |}
HorvathAgeE {c |}
         AA {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      -3.94 {c |}{res}         26        1.03        1.03
{txt}      -2.01 {c |}{res}         25        0.99        2.02
{txt}      -1.72 {c |}{res}         25        0.99        3.01
{txt}      -1.51 {c |}{res}         25        0.99        4.00
{txt}      -1.41 {c |}{res}         26        1.03        5.04
{txt}      -1.29 {c |}{res}         25        0.99        6.03
{txt}      -1.24 {c |}{res}         25        0.99        7.02
{txt}      -1.17 {c |}{res}         25        0.99        8.01
{txt}      -1.12 {c |}{res}         25        0.99        9.00
{txt}      -1.07 {c |}{res}         26        1.03       10.03
{txt}      -1.01 {c |}{res}         25        0.99       11.02
{txt}       -.97 {c |}{res}         25        0.99       12.01
{txt}       -.92 {c |}{res}         25        0.99       13.01
{txt}       -.87 {c |}{res}         26        1.03       14.04
{txt}       -.83 {c |}{res}         25        0.99       15.03
{txt}        -.8 {c |}{res}         25        0.99       16.02
{txt}       -.76 {c |}{res}         25        0.99       17.01
{txt}       -.72 {c |}{res}         25        0.99       18.00
{txt}       -.69 {c |}{res}         26        1.03       19.03
{txt}       -.67 {c |}{res}         25        0.99       20.02
{txt}       -.65 {c |}{res}         25        0.99       21.02
{txt}       -.63 {c |}{res}         25        0.99       22.01
{txt}       -.61 {c |}{res}         26        1.03       23.04
{txt}       -.58 {c |}{res}         25        0.99       24.03
{txt}       -.55 {c |}{res}         25        0.99       25.02
{txt}       -.53 {c |}{res}         25        0.99       26.01
{txt}       -.51 {c |}{res}         25        0.99       27.00
{txt}       -.49 {c |}{res}         26        1.03       28.03
{txt}       -.47 {c |}{res}         25        0.99       29.02
{txt}       -.45 {c |}{res}         25        0.99       30.02
{txt}       -.42 {c |}{res}         25        0.99       31.01
{txt}        -.4 {c |}{res}         26        1.03       32.04
{txt}       -.38 {c |}{res}         25        0.99       33.03
{txt}       -.35 {c |}{res}         25        0.99       34.02
{txt}       -.33 {c |}{res}         25        0.99       35.01
{txt}       -.31 {c |}{res}         25        0.99       36.00
{txt}       -.29 {c |}{res}         26        1.03       37.03
{txt}       -.27 {c |}{res}         25        0.99       38.03
{txt}       -.25 {c |}{res}         25        0.99       39.02
{txt}       -.23 {c |}{res}         25        0.99       40.01
{txt}       -.21 {c |}{res}         26        1.03       41.04
{txt}       -.18 {c |}{res}         25        0.99       42.03
{txt}       -.16 {c |}{res}         25        0.99       43.02
{txt}       -.14 {c |}{res}         25        0.99       44.01
{txt}       -.12 {c |}{res}         25        0.99       45.00
{txt}       -.11 {c |}{res}         26        1.03       46.03
{txt}       -.09 {c |}{res}         25        0.99       47.03
{txt}       -.07 {c |}{res}         25        0.99       48.02
{txt}       -.06 {c |}{res}         25        0.99       49.01
{txt}       -.04 {c |}{res}         25        0.99       50.00
{txt}       -.01 {c |}{res}         26        1.03       51.03
{txt}        .01 {c |}{res}         25        0.99       52.02
{txt}        .03 {c |}{res}         25        0.99       53.01
{txt}        .05 {c |}{res}         25        0.99       54.00
{txt}        .07 {c |}{res}         26        1.03       55.04
{txt}        .09 {c |}{res}         25        0.99       56.03
{txt}        .11 {c |}{res}         25        0.99       57.02
{txt}        .12 {c |}{res}         25        0.99       58.01
{txt}        .14 {c |}{res}         25        0.99       59.00
{txt}        .16 {c |}{res}         26        1.03       60.03
{txt}        .19 {c |}{res}         25        0.99       61.02
{txt}         .2 {c |}{res}         25        0.99       62.01
{txt}        .22 {c |}{res}         25        0.99       63.01
{txt}        .25 {c |}{res}         26        1.03       64.04
{txt}        .27 {c |}{res}         25        0.99       65.03
{txt}        .29 {c |}{res}         25        0.99       66.02
{txt}        .32 {c |}{res}         25        0.99       67.01
{txt}        .35 {c |}{res}         25        0.99       68.00
{txt}        .36 {c |}{res}         26        1.03       69.03
{txt}        .38 {c |}{res}         25        0.99       70.02
{txt}         .4 {c |}{res}         25        0.99       71.02
{txt}        .43 {c |}{res}         25        0.99       72.01
{txt}        .46 {c |}{res}         26        1.03       73.04
{txt}        .49 {c |}{res}         25        0.99       74.03
{txt}        .51 {c |}{res}         25        0.99       75.02
{txt}        .54 {c |}{res}         25        0.99       76.01
{txt}        .57 {c |}{res}         25        0.99       77.00
{txt}        .61 {c |}{res}         26        1.03       78.03
{txt}        .64 {c |}{res}         25        0.99       79.02
{txt}        .66 {c |}{res}         25        0.99       80.02
{txt}        .68 {c |}{res}         25        0.99       81.01
{txt}        .71 {c |}{res}         26        1.03       82.04
{txt}        .74 {c |}{res}         25        0.99       83.03
{txt}        .78 {c |}{res}         25        0.99       84.02
{txt}        .82 {c |}{res}         25        0.99       85.01
{txt}        .86 {c |}{res}         25        0.99       86.00
{txt}        .91 {c |}{res}         26        1.03       87.03
{txt}        .96 {c |}{res}         25        0.99       88.03
{txt}          1 {c |}{res}         25        0.99       89.02
{txt}       1.06 {c |}{res}         25        0.99       90.01
{txt}       1.14 {c |}{res}         26        1.03       91.04
{txt}        1.2 {c |}{res}         25        0.99       92.03
{txt}       1.27 {c |}{res}         25        0.99       93.02
{txt}       1.33 {c |}{res}         25        0.99       94.01
{txt}       1.45 {c |}{res}         25        0.99       95.00
{txt}       1.58 {c |}{res}         26        1.03       96.03
{txt}       1.76 {c |}{res}         25        0.99       97.03
{txt}       1.98 {c |}{res}         25        0.99       98.02
{txt}       2.34 {c |}{res}         25        0.99       99.01
{txt}       3.12 {c |}{res}         25        0.99      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00
{txt}(2,522 real changes made)
(2,522 real changes made)
(bin={res}34{txt}, start={res}-3.6199999{txt}, width={res}.20352941{txt})
{res}
{txt}Standardize {c |}
d values of {c |}
HannumAgeEA {c |}
          A {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      -3.62 {c |}{res}         26        1.03        1.03
{txt}      -2.18 {c |}{res}         25        0.99        2.02
{txt}      -1.81 {c |}{res}         25        0.99        3.01
{txt}      -1.68 {c |}{res}         25        0.99        4.00
{txt}      -1.51 {c |}{res}         26        1.03        5.04
{txt}      -1.36 {c |}{res}         25        0.99        6.03
{txt}      -1.28 {c |}{res}         25        0.99        7.02
{txt}      -1.19 {c |}{res}         25        0.99        8.01
{txt}      -1.13 {c |}{res}         25        0.99        9.00
{txt}      -1.05 {c |}{res}         26        1.03       10.03
{txt}         -1 {c |}{res}         25        0.99       11.02
{txt}       -.96 {c |}{res}         25        0.99       12.01
{txt}       -.91 {c |}{res}         25        0.99       13.01
{txt}       -.88 {c |}{res}         26        1.03       14.04
{txt}       -.84 {c |}{res}         25        0.99       15.03
{txt}       -.81 {c |}{res}         25        0.99       16.02
{txt}       -.79 {c |}{res}         25        0.99       17.01
{txt}       -.75 {c |}{res}         25        0.99       18.00
{txt}       -.72 {c |}{res}         26        1.03       19.03
{txt}       -.69 {c |}{res}         25        0.99       20.02
{txt}       -.65 {c |}{res}         25        0.99       21.02
{txt}       -.63 {c |}{res}         25        0.99       22.01
{txt}        -.6 {c |}{res}         26        1.03       23.04
{txt}       -.57 {c |}{res}         25        0.99       24.03
{txt}       -.53 {c |}{res}         25        0.99       25.02
{txt}       -.51 {c |}{res}         25        0.99       26.01
{txt}       -.49 {c |}{res}         25        0.99       27.00
{txt}       -.47 {c |}{res}         26        1.03       28.03
{txt}       -.45 {c |}{res}         25        0.99       29.02
{txt}       -.42 {c |}{res}         25        0.99       30.02
{txt}       -.39 {c |}{res}         25        0.99       31.01
{txt}       -.37 {c |}{res}         26        1.03       32.04
{txt}       -.34 {c |}{res}         25        0.99       33.03
{txt}       -.32 {c |}{res}         25        0.99       34.02
{txt}        -.3 {c |}{res}         25        0.99       35.01
{txt}       -.28 {c |}{res}         25        0.99       36.00
{txt}       -.26 {c |}{res}         26        1.03       37.03
{txt}       -.23 {c |}{res}         25        0.99       38.03
{txt}       -.21 {c |}{res}         25        0.99       39.02
{txt}       -.19 {c |}{res}         25        0.99       40.01
{txt}       -.18 {c |}{res}         26        1.03       41.04
{txt}       -.16 {c |}{res}         25        0.99       42.03
{txt}       -.14 {c |}{res}         25        0.99       43.02
{txt}       -.13 {c |}{res}         25        0.99       44.01
{txt}       -.11 {c |}{res}         25        0.99       45.00
{txt}       -.09 {c |}{res}         26        1.03       46.03
{txt}       -.06 {c |}{res}         25        0.99       47.03
{txt}       -.04 {c |}{res}         25        0.99       48.02
{txt}       -.02 {c |}{res}         25        0.99       49.01
{txt}          0 {c |}{res}         25        0.99       50.00
{txt}        .02 {c |}{res}         26        1.03       51.03
{txt}        .05 {c |}{res}         25        0.99       52.02
{txt}        .07 {c |}{res}         25        0.99       53.01
{txt}        .08 {c |}{res}         25        0.99       54.00
{txt}         .1 {c |}{res}         26        1.03       55.04
{txt}        .12 {c |}{res}         25        0.99       56.03
{txt}        .15 {c |}{res}         25        0.99       57.02
{txt}        .16 {c |}{res}         25        0.99       58.01
{txt}        .18 {c |}{res}         25        0.99       59.00
{txt}         .2 {c |}{res}         26        1.03       60.03
{txt}        .22 {c |}{res}         25        0.99       61.02
{txt}        .25 {c |}{res}         25        0.99       62.01
{txt}        .26 {c |}{res}         25        0.99       63.01
{txt}        .28 {c |}{res}         26        1.03       64.04
{txt}         .3 {c |}{res}         25        0.99       65.03
{txt}        .33 {c |}{res}         25        0.99       66.02
{txt}        .35 {c |}{res}         25        0.99       67.01
{txt}        .37 {c |}{res}         25        0.99       68.00
{txt}         .4 {c |}{res}         26        1.03       69.03
{txt}        .42 {c |}{res}         25        0.99       70.02
{txt}        .44 {c |}{res}         25        0.99       71.02
{txt}        .46 {c |}{res}         25        0.99       72.01
{txt}        .48 {c |}{res}         26        1.03       73.04
{txt}         .5 {c |}{res}         25        0.99       74.03
{txt}        .52 {c |}{res}         25        0.99       75.02
{txt}        .55 {c |}{res}         25        0.99       76.01
{txt}        .58 {c |}{res}         25        0.99       77.00
{txt}         .6 {c |}{res}         26        1.03       78.03
{txt}        .62 {c |}{res}         25        0.99       79.02
{txt}        .65 {c |}{res}         25        0.99       80.02
{txt}        .69 {c |}{res}         25        0.99       81.01
{txt}        .71 {c |}{res}         26        1.03       82.04
{txt}        .74 {c |}{res}         25        0.99       83.03
{txt}        .77 {c |}{res}         25        0.99       84.02
{txt}        .81 {c |}{res}         25        0.99       85.01
{txt}        .85 {c |}{res}         25        0.99       86.00
{txt}        .88 {c |}{res}         26        1.03       87.03
{txt}        .92 {c |}{res}         25        0.99       88.03
{txt}        .97 {c |}{res}         25        0.99       89.02
{txt}       1.02 {c |}{res}         25        0.99       90.01
{txt}        1.1 {c |}{res}         26        1.03       91.04
{txt}       1.16 {c |}{res}         25        0.99       92.03
{txt}       1.23 {c |}{res}         25        0.99       93.02
{txt}       1.31 {c |}{res}         25        0.99       94.01
{txt}       1.38 {c |}{res}         25        0.99       95.00
{txt}       1.52 {c |}{res}         26        1.03       96.03
{txt}       1.71 {c |}{res}         25        0.99       97.03
{txt}        1.9 {c |}{res}         25        0.99       98.02
{txt}       2.21 {c |}{res}         25        0.99       99.01
{txt}        3.3 {c |}{res}         25        0.99      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00
{txt}(2,522 real changes made)
(2,522 real changes made)
(bin={res}34{txt}, start={res}-3.3299999{txt}, width={res}.17735294{txt})
{res}
{txt}Standardize {c |}
d values of {c |}
PhenoAgeEAA {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      -3.33 {c |}{res}         26        1.03        1.03
{txt}      -2.13 {c |}{res}         25        0.99        2.02
{txt}      -1.78 {c |}{res}         25        0.99        3.01
{txt}       -1.6 {c |}{res}         25        0.99        4.00
{txt}      -1.51 {c |}{res}         26        1.03        5.04
{txt}       -1.4 {c |}{res}         25        0.99        6.03
{txt}      -1.33 {c |}{res}         25        0.99        7.02
{txt}      -1.24 {c |}{res}         25        0.99        8.01
{txt}      -1.18 {c |}{res}         25        0.99        9.00
{txt}      -1.13 {c |}{res}         26        1.03       10.03
{txt}      -1.09 {c |}{res}         25        0.99       11.02
{txt}      -1.02 {c |}{res}         25        0.99       12.01
{txt}       -.98 {c |}{res}         25        0.99       13.01
{txt}       -.95 {c |}{res}         26        1.03       14.04
{txt}       -.92 {c |}{res}         25        0.99       15.03
{txt}        -.9 {c |}{res}         25        0.99       16.02
{txt}       -.86 {c |}{res}         25        0.99       17.01
{txt}       -.82 {c |}{res}         25        0.99       18.00
{txt}       -.79 {c |}{res}         26        1.03       19.03
{txt}       -.75 {c |}{res}         25        0.99       20.02
{txt}       -.72 {c |}{res}         25        0.99       21.02
{txt}       -.69 {c |}{res}         25        0.99       22.01
{txt}       -.66 {c |}{res}         26        1.03       23.04
{txt}       -.63 {c |}{res}         25        0.99       24.03
{txt}       -.59 {c |}{res}         25        0.99       25.02
{txt}       -.57 {c |}{res}         25        0.99       26.01
{txt}       -.54 {c |}{res}         25        0.99       27.00
{txt}       -.53 {c |}{res}         26        1.03       28.03
{txt}        -.5 {c |}{res}         25        0.99       29.02
{txt}       -.48 {c |}{res}         25        0.99       30.02
{txt}       -.45 {c |}{res}         25        0.99       31.01
{txt}       -.43 {c |}{res}         26        1.03       32.04
{txt}       -.41 {c |}{res}         25        0.99       33.03
{txt}       -.39 {c |}{res}         25        0.99       34.02
{txt}       -.36 {c |}{res}         25        0.99       35.01
{txt}       -.33 {c |}{res}         25        0.99       36.00
{txt}       -.31 {c |}{res}         26        1.03       37.03
{txt}       -.29 {c |}{res}         25        0.99       38.03
{txt}       -.26 {c |}{res}         25        0.99       39.02
{txt}       -.24 {c |}{res}         25        0.99       40.01
{txt}       -.21 {c |}{res}         26        1.03       41.04
{txt}       -.19 {c |}{res}         25        0.99       42.03
{txt}       -.16 {c |}{res}         25        0.99       43.02
{txt}       -.13 {c |}{res}         25        0.99       44.01
{txt}       -.11 {c |}{res}         25        0.99       45.00
{txt}        -.1 {c |}{res}         26        1.03       46.03
{txt}       -.08 {c |}{res}         25        0.99       47.03
{txt}       -.06 {c |}{res}         25        0.99       48.02
{txt}       -.03 {c |}{res}         25        0.99       49.01
{txt}       -.01 {c |}{res}         25        0.99       50.00
{txt}        .02 {c |}{res}         26        1.03       51.03
{txt}        .05 {c |}{res}         25        0.99       52.02
{txt}        .06 {c |}{res}         25        0.99       53.01
{txt}        .09 {c |}{res}         25        0.99       54.00
{txt}        .11 {c |}{res}         26        1.03       55.04
{txt}        .12 {c |}{res}         25        0.99       56.03
{txt}        .15 {c |}{res}         25        0.99       57.02
{txt}        .16 {c |}{res}         25        0.99       58.01
{txt}        .18 {c |}{res}         25        0.99       59.00
{txt}        .21 {c |}{res}         26        1.03       60.03
{txt}        .23 {c |}{res}         25        0.99       61.02
{txt}        .25 {c |}{res}         25        0.99       62.01
{txt}        .26 {c |}{res}         25        0.99       63.01
{txt}        .28 {c |}{res}         26        1.03       64.04
{txt}         .3 {c |}{res}         25        0.99       65.03
{txt}        .32 {c |}{res}         25        0.99       66.02
{txt}        .35 {c |}{res}         25        0.99       67.01
{txt}        .37 {c |}{res}         25        0.99       68.00
{txt}        .39 {c |}{res}         26        1.03       69.03
{txt}        .43 {c |}{res}         25        0.99       70.02
{txt}        .45 {c |}{res}         25        0.99       71.02
{txt}        .47 {c |}{res}         25        0.99       72.01
{txt}        .51 {c |}{res}         26        1.03       73.04
{txt}        .53 {c |}{res}         25        0.99       74.03
{txt}        .55 {c |}{res}         25        0.99       75.02
{txt}        .57 {c |}{res}         25        0.99       76.01
{txt}         .6 {c |}{res}         25        0.99       77.00
{txt}        .64 {c |}{res}         26        1.03       78.03
{txt}        .67 {c |}{res}         25        0.99       79.02
{txt}         .7 {c |}{res}         25        0.99       80.02
{txt}        .73 {c |}{res}         25        0.99       81.01
{txt}        .77 {c |}{res}         26        1.03       82.04
{txt}        .82 {c |}{res}         25        0.99       83.03
{txt}        .86 {c |}{res}         25        0.99       84.02
{txt}        .91 {c |}{res}         25        0.99       85.01
{txt}        .95 {c |}{res}         25        0.99       86.00
{txt}       1.01 {c |}{res}         26        1.03       87.03
{txt}       1.05 {c |}{res}         25        0.99       88.03
{txt}       1.11 {c |}{res}         25        0.99       89.02
{txt}       1.14 {c |}{res}         25        0.99       90.01
{txt}       1.21 {c |}{res}         26        1.03       91.04
{txt}       1.26 {c |}{res}         25        0.99       92.03
{txt}       1.33 {c |}{res}         25        0.99       93.02
{txt}       1.41 {c |}{res}         25        0.99       94.01
{txt}       1.51 {c |}{res}         25        0.99       95.00
{txt}       1.62 {c |}{res}         26        1.03       96.03
{txt}       1.75 {c |}{res}         25        0.99       97.03
{txt}       1.97 {c |}{res}         25        0.99       98.02
{txt}       2.22 {c |}{res}         25        0.99       99.01
{txt}        2.7 {c |}{res}         25        0.99      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00
{txt}(2,522 real changes made)
(2,522 real changes made)
(bin={res}34{txt}, start={res}-1.97{txt}, width={res}.14882353{txt})
{res}
{txt}Standardize {c |}
d values of {c |}
GrimAgeMort {c |}
        EAA {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      -1.97 {c |}{res}         26        1.03        1.03
{txt}      -1.68 {c |}{res}         25        0.99        2.02
{txt}      -1.53 {c |}{res}         25        0.99        3.01
{txt}      -1.45 {c |}{res}         25        0.99        4.00
{txt}      -1.39 {c |}{res}         26        1.03        5.04
{txt}      -1.33 {c |}{res}         25        0.99        6.03
{txt}      -1.28 {c |}{res}         25        0.99        7.02
{txt}      -1.22 {c |}{res}         25        0.99        8.01
{txt}      -1.18 {c |}{res}         25        0.99        9.00
{txt}      -1.15 {c |}{res}         26        1.03       10.03
{txt}      -1.12 {c |}{res}         25        0.99       11.02
{txt}      -1.08 {c |}{res}         25        0.99       12.01
{txt}      -1.04 {c |}{res}         25        0.99       13.01
{txt}      -1.01 {c |}{res}         26        1.03       14.04
{txt}       -.97 {c |}{res}         25        0.99       15.03
{txt}       -.93 {c |}{res}         25        0.99       16.02
{txt}       -.91 {c |}{res}         25        0.99       17.01
{txt}       -.89 {c |}{res}         25        0.99       18.00
{txt}       -.87 {c |}{res}         26        1.03       19.03
{txt}       -.84 {c |}{res}         25        0.99       20.02
{txt}       -.82 {c |}{res}         25        0.99       21.02
{txt}        -.8 {c |}{res}         25        0.99       22.01
{txt}       -.77 {c |}{res}         26        1.03       23.04
{txt}       -.75 {c |}{res}         25        0.99       24.03
{txt}       -.73 {c |}{res}         25        0.99       25.02
{txt}        -.7 {c |}{res}         25        0.99       26.01
{txt}       -.68 {c |}{res}         25        0.99       27.00
{txt}       -.66 {c |}{res}         26        1.03       28.03
{txt}       -.64 {c |}{res}         25        0.99       29.02
{txt}       -.61 {c |}{res}         25        0.99       30.02
{txt}       -.59 {c |}{res}         25        0.99       31.01
{txt}       -.57 {c |}{res}         26        1.03       32.04
{txt}       -.55 {c |}{res}         25        0.99       33.03
{txt}       -.52 {c |}{res}         25        0.99       34.02
{txt}       -.51 {c |}{res}         25        0.99       35.01
{txt}       -.48 {c |}{res}         25        0.99       36.00
{txt}       -.46 {c |}{res}         26        1.03       37.03
{txt}       -.44 {c |}{res}         25        0.99       38.03
{txt}       -.42 {c |}{res}         25        0.99       39.02
{txt}        -.4 {c |}{res}         25        0.99       40.01
{txt}       -.38 {c |}{res}         26        1.03       41.04
{txt}       -.36 {c |}{res}         25        0.99       42.03
{txt}       -.35 {c |}{res}         25        0.99       43.02
{txt}       -.33 {c |}{res}         25        0.99       44.01
{txt}       -.31 {c |}{res}         25        0.99       45.00
{txt}       -.29 {c |}{res}         26        1.03       46.03
{txt}       -.26 {c |}{res}         25        0.99       47.03
{txt}       -.23 {c |}{res}         25        0.99       48.02
{txt}       -.21 {c |}{res}         25        0.99       49.01
{txt}       -.18 {c |}{res}         25        0.99       50.00
{txt}       -.16 {c |}{res}         26        1.03       51.03
{txt}       -.13 {c |}{res}         25        0.99       52.02
{txt}       -.11 {c |}{res}         25        0.99       53.01
{txt}        -.1 {c |}{res}         25        0.99       54.00
{txt}       -.07 {c |}{res}         26        1.03       55.04
{txt}       -.03 {c |}{res}         25        0.99       56.03
{txt}          0 {c |}{res}         25        0.99       57.02
{txt}        .01 {c |}{res}         25        0.99       58.01
{txt}        .04 {c |}{res}         25        0.99       59.00
{txt}        .07 {c |}{res}         26        1.03       60.03
{txt}        .09 {c |}{res}         25        0.99       61.02
{txt}        .12 {c |}{res}         25        0.99       62.01
{txt}        .15 {c |}{res}         25        0.99       63.01
{txt}        .18 {c |}{res}         26        1.03       64.04
{txt}        .21 {c |}{res}         25        0.99       65.03
{txt}        .23 {c |}{res}         25        0.99       66.02
{txt}        .26 {c |}{res}         25        0.99       67.01
{txt}         .3 {c |}{res}         25        0.99       68.00
{txt}        .33 {c |}{res}         26        1.03       69.03
{txt}        .38 {c |}{res}         25        0.99       70.02
{txt}        .41 {c |}{res}         25        0.99       71.02
{txt}        .46 {c |}{res}         25        0.99       72.01
{txt}        .49 {c |}{res}         26        1.03       73.04
{txt}        .53 {c |}{res}         25        0.99       74.03
{txt}        .56 {c |}{res}         25        0.99       75.02
{txt}         .6 {c |}{res}         25        0.99       76.01
{txt}        .64 {c |}{res}         25        0.99       77.00
{txt}        .69 {c |}{res}         26        1.03       78.03
{txt}        .74 {c |}{res}         25        0.99       79.02
{txt}        .78 {c |}{res}         25        0.99       80.02
{txt}        .82 {c |}{res}         25        0.99       81.01
{txt}        .89 {c |}{res}         26        1.03       82.04
{txt}        .94 {c |}{res}         25        0.99       83.03
{txt}        .99 {c |}{res}         25        0.99       84.02
{txt}       1.04 {c |}{res}         25        0.99       85.01
{txt}        1.1 {c |}{res}         25        0.99       86.00
{txt}       1.17 {c |}{res}         26        1.03       87.03
{txt}       1.23 {c |}{res}         25        0.99       88.03
{txt}       1.32 {c |}{res}         25        0.99       89.02
{txt}       1.38 {c |}{res}         25        0.99       90.01
{txt}       1.46 {c |}{res}         26        1.03       91.04
{txt}       1.51 {c |}{res}         25        0.99       92.03
{txt}       1.59 {c |}{res}         25        0.99       93.02
{txt}       1.69 {c |}{res}         25        0.99       94.01
{txt}       1.79 {c |}{res}         25        0.99       95.00
{txt}       1.95 {c |}{res}         26        1.03       96.03
{txt}       2.16 {c |}{res}         25        0.99       97.03
{txt}       2.39 {c |}{res}         25        0.99       98.02
{txt}       2.61 {c |}{res}         25        0.99       99.01
{txt}       3.09 {c |}{res}         25        0.99      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00
{txt}(2,522 real changes made)
(2,522 real changes made)
(bin={res}34{txt}, start={res}-2.0999999{txt}, width={res}.14970588{txt})
{res}
{txt}Standardize {c |}
d values of {c |}
DunedinPoAm {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       -2.1 {c |}{res}         26        1.03        1.03
{txt}      -1.84 {c |}{res}         25        0.99        2.02
{txt}      -1.68 {c |}{res}         25        0.99        3.01
{txt}      -1.57 {c |}{res}         25        0.99        4.00
{txt}      -1.47 {c |}{res}         26        1.03        5.04
{txt}      -1.39 {c |}{res}         25        0.99        6.03
{txt}      -1.33 {c |}{res}         25        0.99        7.02
{txt}      -1.29 {c |}{res}         25        0.99        8.01
{txt}      -1.23 {c |}{res}         25        0.99        9.00
{txt}      -1.18 {c |}{res}         26        1.03       10.03
{txt}      -1.15 {c |}{res}         25        0.99       11.02
{txt}      -1.11 {c |}{res}         25        0.99       12.01
{txt}      -1.06 {c |}{res}         25        0.99       13.01
{txt}      -1.02 {c |}{res}         26        1.03       14.04
{txt}         -1 {c |}{res}         25        0.99       15.03
{txt}       -.97 {c |}{res}         25        0.99       16.02
{txt}       -.94 {c |}{res}         25        0.99       17.01
{txt}       -.91 {c |}{res}         25        0.99       18.00
{txt}       -.88 {c |}{res}         26        1.03       19.03
{txt}       -.85 {c |}{res}         25        0.99       20.02
{txt}       -.82 {c |}{res}         25        0.99       21.02
{txt}       -.79 {c |}{res}         25        0.99       22.01
{txt}       -.77 {c |}{res}         26        1.03       23.04
{txt}       -.74 {c |}{res}         25        0.99       24.03
{txt}       -.71 {c |}{res}         25        0.99       25.02
{txt}       -.69 {c |}{res}         25        0.99       26.01
{txt}       -.66 {c |}{res}         25        0.99       27.00
{txt}       -.64 {c |}{res}         26        1.03       28.03
{txt}       -.62 {c |}{res}         25        0.99       29.02
{txt}       -.59 {c |}{res}         25        0.99       30.02
{txt}       -.57 {c |}{res}         25        0.99       31.01
{txt}       -.55 {c |}{res}         26        1.03       32.04
{txt}       -.53 {c |}{res}         25        0.99       33.03
{txt}        -.5 {c |}{res}         25        0.99       34.02
{txt}       -.49 {c |}{res}         25        0.99       35.01
{txt}       -.47 {c |}{res}         25        0.99       36.00
{txt}       -.45 {c |}{res}         26        1.03       37.03
{txt}       -.43 {c |}{res}         25        0.99       38.03
{txt}        -.4 {c |}{res}         25        0.99       39.02
{txt}       -.37 {c |}{res}         25        0.99       40.01
{txt}       -.34 {c |}{res}         26        1.03       41.04
{txt}       -.32 {c |}{res}         25        0.99       42.03
{txt}       -.29 {c |}{res}         25        0.99       43.02
{txt}       -.27 {c |}{res}         25        0.99       44.01
{txt}       -.25 {c |}{res}         25        0.99       45.00
{txt}       -.22 {c |}{res}         26        1.03       46.03
{txt}        -.2 {c |}{res}         25        0.99       47.03
{txt}       -.18 {c |}{res}         25        0.99       48.02
{txt}       -.16 {c |}{res}         25        0.99       49.01
{txt}       -.12 {c |}{res}         25        0.99       50.00
{txt}        -.1 {c |}{res}         26        1.03       51.03
{txt}       -.08 {c |}{res}         25        0.99       52.02
{txt}       -.05 {c |}{res}         25        0.99       53.01
{txt}       -.03 {c |}{res}         25        0.99       54.00
{txt}        .01 {c |}{res}         26        1.03       55.04
{txt}        .02 {c |}{res}         25        0.99       56.03
{txt}        .05 {c |}{res}         25        0.99       57.02
{txt}        .08 {c |}{res}         25        0.99       58.01
{txt}        .11 {c |}{res}         25        0.99       59.00
{txt}        .13 {c |}{res}         26        1.03       60.03
{txt}        .17 {c |}{res}         25        0.99       61.02
{txt}        .19 {c |}{res}         25        0.99       62.01
{txt}        .21 {c |}{res}         25        0.99       63.01
{txt}        .24 {c |}{res}         26        1.03       64.04
{txt}        .26 {c |}{res}         25        0.99       65.03
{txt}        .28 {c |}{res}         25        0.99       66.02
{txt}        .31 {c |}{res}         25        0.99       67.01
{txt}        .34 {c |}{res}         25        0.99       68.00
{txt}        .37 {c |}{res}         26        1.03       69.03
{txt}        .39 {c |}{res}         25        0.99       70.02
{txt}        .42 {c |}{res}         25        0.99       71.02
{txt}        .45 {c |}{res}         25        0.99       72.01
{txt}        .48 {c |}{res}         26        1.03       73.04
{txt}        .52 {c |}{res}         25        0.99       74.03
{txt}        .56 {c |}{res}         25        0.99       75.02
{txt}         .6 {c |}{res}         25        0.99       76.01
{txt}        .64 {c |}{res}         25        0.99       77.00
{txt}        .67 {c |}{res}         26        1.03       78.03
{txt}        .72 {c |}{res}         25        0.99       79.02
{txt}        .79 {c |}{res}         25        0.99       80.02
{txt}        .84 {c |}{res}         25        0.99       81.01
{txt}        .88 {c |}{res}         26        1.03       82.04
{txt}        .92 {c |}{res}         25        0.99       83.03
{txt}        .98 {c |}{res}         25        0.99       84.02
{txt}       1.03 {c |}{res}         25        0.99       85.01
{txt}       1.08 {c |}{res}         25        0.99       86.00
{txt}       1.14 {c |}{res}         26        1.03       87.03
{txt}       1.19 {c |}{res}         25        0.99       88.03
{txt}       1.24 {c |}{res}         25        0.99       89.02
{txt}        1.3 {c |}{res}         25        0.99       90.01
{txt}       1.38 {c |}{res}         26        1.03       91.04
{txt}       1.49 {c |}{res}         25        0.99       92.03
{txt}       1.54 {c |}{res}         25        0.99       93.02
{txt}       1.62 {c |}{res}         25        0.99       94.01
{txt}       1.78 {c |}{res}         25        0.99       95.00
{txt}       1.91 {c |}{res}         26        1.03       96.03
{txt}       2.09 {c |}{res}         25        0.99       97.03
{txt}       2.29 {c |}{res}         25        0.99       98.02
{txt}       2.58 {c |}{res}         25        0.99       99.01
{txt}       2.99 {c |}{res}         25        0.99      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00
{txt}(2,522 real changes made)
(2,522 real changes made)
(bin={res}34{txt}, start={res}-2.01{txt}, width={res}.13352941{txt})
{res}
{txt}Standardize {c |}
d values of {c |}
telomean_no {c |}
  _outliers {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      -2.01 {c |}{res}         26        1.03        1.03
{txt}      -1.84 {c |}{res}         25        0.99        2.02
{txt}      -1.75 {c |}{res}         25        0.99        3.01
{txt}      -1.69 {c |}{res}         25        0.99        4.00
{txt}      -1.63 {c |}{res}         26        1.03        5.04
{txt}      -1.57 {c |}{res}         25        0.99        6.03
{txt}      -1.52 {c |}{res}         25        0.99        7.02
{txt}      -1.47 {c |}{res}         25        0.99        8.01
{txt}      -1.44 {c |}{res}         25        0.99        9.00
{txt}       -1.4 {c |}{res}         26        1.03       10.03
{txt}      -1.37 {c |}{res}         25        0.99       11.02
{txt}      -1.33 {c |}{res}         25        0.99       12.01
{txt}       -1.3 {c |}{res}         25        0.99       13.01
{txt}      -1.28 {c |}{res}         26        1.03       14.04
{txt}      -1.24 {c |}{res}         25        0.99       15.03
{txt}      -1.21 {c |}{res}         25        0.99       16.02
{txt}      -1.19 {c |}{res}         25        0.99       17.01
{txt}      -1.16 {c |}{res}         25        0.99       18.00
{txt}      -1.13 {c |}{res}         26        1.03       19.03
{txt}       -1.1 {c |}{res}         25        0.99       20.02
{txt}      -1.08 {c |}{res}         25        0.99       21.02
{txt}      -1.06 {c |}{res}         25        0.99       22.01
{txt}      -1.04 {c |}{res}         26        1.03       23.04
{txt}      -1.02 {c |}{res}         25        0.99       24.03
{txt}         -1 {c |}{res}         25        0.99       25.02
{txt}       -.98 {c |}{res}         25        0.99       26.01
{txt}       -.96 {c |}{res}         25        0.99       27.00
{txt}       -.94 {c |}{res}         26        1.03       28.03
{txt}       -.91 {c |}{res}         25        0.99       29.02
{txt}        -.9 {c |}{res}         25        0.99       30.02
{txt}       -.88 {c |}{res}         25        0.99       31.01
{txt}       -.86 {c |}{res}         26        1.03       32.04
{txt}       -.84 {c |}{res}         25        0.99       33.03
{txt}       -.82 {c |}{res}         25        0.99       34.02
{txt}        -.8 {c |}{res}         25        0.99       35.01
{txt}       -.78 {c |}{res}         25        0.99       36.00
{txt}       -.76 {c |}{res}         26        1.03       37.03
{txt}       -.74 {c |}{res}         25        0.99       38.03
{txt}       -.73 {c |}{res}         25        0.99       39.02
{txt}       -.71 {c |}{res}         25        0.99       40.01
{txt}        -.7 {c |}{res}         26        1.03       41.04
{txt}       -.68 {c |}{res}         25        0.99       42.03
{txt}       -.65 {c |}{res}         25        0.99       43.02
{txt}       -.63 {c |}{res}         25        0.99       44.01
{txt}        -.6 {c |}{res}         25        0.99       45.00
{txt}       -.58 {c |}{res}         26        1.03       46.03
{txt}       -.56 {c |}{res}         25        0.99       47.03
{txt}       -.55 {c |}{res}         25        0.99       48.02
{txt}       -.54 {c |}{res}         25        0.99       49.01
{txt}       -.52 {c |}{res}         25        0.99       50.00
{txt}        -.5 {c |}{res}         26        1.03       51.03
{txt}       -.47 {c |}{res}         25        0.99       52.02
{txt}       -.44 {c |}{res}         25        0.99       53.01
{txt}       -.42 {c |}{res}         25        0.99       54.00
{txt}       -.41 {c |}{res}         26        1.03       55.04
{txt}       -.39 {c |}{res}         25        0.99       56.03
{txt}       -.37 {c |}{res}         25        0.99       57.02
{txt}       -.34 {c |}{res}         25        0.99       58.01
{txt}       -.32 {c |}{res}         25        0.99       59.00
{txt}        -.3 {c |}{res}         26        1.03       60.03
{txt}       -.28 {c |}{res}         25        0.99       61.02
{txt}       -.26 {c |}{res}         25        0.99       62.01
{txt}       -.24 {c |}{res}         25        0.99       63.01
{txt}       -.22 {c |}{res}         26        1.03       64.04
{txt}        -.2 {c |}{res}         25        0.99       65.03
{txt}       -.17 {c |}{res}         25        0.99       66.02
{txt}       -.15 {c |}{res}         25        0.99       67.01
{txt}       -.12 {c |}{res}         25        0.99       68.00
{txt}       -.09 {c |}{res}         26        1.03       69.03
{txt}       -.06 {c |}{res}         25        0.99       70.02
{txt}       -.03 {c |}{res}         25        0.99       71.02
{txt}          0 {c |}{res}         25        0.99       72.01
{txt}        .02 {c |}{res}         26        1.03       73.04
{txt}        .05 {c |}{res}         25        0.99       74.03
{txt}        .08 {c |}{res}         25        0.99       75.02
{txt}        .11 {c |}{res}         25        0.99       76.01
{txt}        .15 {c |}{res}         25        0.99       77.00
{txt}        .18 {c |}{res}         26        1.03       78.03
{txt}        .21 {c |}{res}         25        0.99       79.02
{txt}        .25 {c |}{res}         25        0.99       80.02
{txt}        .29 {c |}{res}         25        0.99       81.01
{txt}        .32 {c |}{res}         26        1.03       82.04
{txt}        .36 {c |}{res}         25        0.99       83.03
{txt}        .39 {c |}{res}         25        0.99       84.02
{txt}        .43 {c |}{res}         25        0.99       85.01
{txt}        .47 {c |}{res}         25        0.99       86.00
{txt}        .53 {c |}{res}         26        1.03       87.03
{txt}         .6 {c |}{res}         25        0.99       88.03
{txt}        .67 {c |}{res}         25        0.99       89.02
{txt}        .73 {c |}{res}         25        0.99       90.01
{txt}        .81 {c |}{res}         26        1.03       91.04
{txt}        .87 {c |}{res}         25        0.99       92.03
{txt}        .94 {c |}{res}         25        0.99       93.02
{txt}       1.02 {c |}{res}         25        0.99       94.01
{txt}       1.16 {c |}{res}         25        0.99       95.00
{txt}       1.27 {c |}{res}         26        1.03       96.03
{txt}       1.42 {c |}{res}         25        0.99       97.03
{txt}       1.63 {c |}{res}         25        0.99       98.02
{txt}        1.8 {c |}{res}         25        0.99       99.01
{txt}       2.53 {c |}{res}         25        0.99      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00
{txt}
{com}. 
. *MORTALITY*
. tab _d

       {txt}1 if {c |}
 failure; 0 {c |}
if censored {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,167       46.27       46.27
{txt}          1 {c |}{res}      1,355       53.73      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00
{txt}
{com}. 
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN.dta{rm}
saved
{p_end}

{com}. 
. 
. keep seqn AGE SEX NHB HISP OTHER zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm ztelomean_no_outliers   _d _st _d _t _t0 COHORT
{txt}
{com}. 
. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN_SMALL",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN_SMALL.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}