{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. //STEP 17: GENERATE DATASET WITH DISCRETE TIME HAZARDS: 2 YR INTERVALS: FRIDAY PLUS CORRECT FIGURES USING SAMPLING WEIGHTS (K-M and Error bar) //
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN_SMALL",clear
{txt}
{com}. 
. sort seqn
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN_SMALL",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN_SMALL.dta{rm}
saved
{p_end}

{com}. 
. 
. * Step 1: Expand the dataset
. capture drop period
{txt}
{com}. gen period = floor(_t / 2) + 1  // Create time periods based on 2-year intervals
{txt}
{com}. expand period  // Expand the dataset for each time period
{txt}(16,423 observations created)

{com}. 
. * Step 2: Create time variables for analysis
. capture drop start_time
{txt}
{com}. capture drop end_time
{txt}
{com}. 
. bysort seqn: gen start_time = (_n - 1) * 2  // Start of each 2-year period
{txt}
{com}. bysort seqn: gen end_time = start_time + 2  // End of each 2-year period
{txt}
{com}. 
. * Step 3: Indicate event occurrence in each period
. capture drop event
{txt}
{com}. 
. gen event = (_d == 1 & _t <= end_time & _t > start_time)
{txt}
{com}. 
. * Step 4: Create dummy variables for each 2-year interval
. gen interval = floor(start_time / 2) + 1  // Create interval number
{txt}
{com}. tabulate interval, generate(dummy)  // Generate dummy variables for each interval

   {txt}interval {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      2,522       13.31       13.31
{txt}          2 {c |}{res}      2,429       12.82       26.13
{txt}          3 {c |}{res}      2,296       12.12       38.25
{txt}          4 {c |}{res}      2,131       11.25       49.50
{txt}          5 {c |}{res}      1,982       10.46       59.96
{txt}          6 {c |}{res}      1,828        9.65       69.61
{txt}          7 {c |}{res}      1,681        8.87       78.49
{txt}          8 {c |}{res}      1,529        8.07       86.56
{txt}          9 {c |}{res}      1,377        7.27       93.82
{txt}         10 {c |}{res}        918        4.85       98.67
{txt}         11 {c |}{res}        252        1.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     18,945      100.00
{txt}
{com}. 
. 
. logistic _d dummy1-dummy10 AGE SEX NHB HISP OTHER zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm ztelomean_no_outliers  
{res}
{txt}{col 1}Logistic regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:18,945}
{txt}{col 56}{lalign 13:LR chi2({res:21})}{col 69} = {res}{ralign 7:7304.86}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-9000.9624}{txt}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.2887}

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                   _d{col 23}{c |} Odds ratio{col 35}   Std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}dummy1 {c |}{col 23}{res}{space 2} 80.22966{col 35}{space 2} 47.40323{col 46}{space 1}    7.42{col 55}{space 3}0.000{col 63}{space 4}  25.2004{col 76}{space 3} 255.4244
{txt}{space 15}dummy2 {c |}{col 23}{res}{space 2} 76.51427{col 35}{space 2} 45.21199{col 46}{space 1}    7.34{col 55}{space 3}0.000{col 63}{space 4} 24.03094{col 76}{space 3} 243.6207
{txt}{space 15}dummy3 {c |}{col 23}{res}{space 2} 71.23816{col 35}{space 2} 42.10047{col 46}{space 1}    7.22{col 55}{space 3}0.000{col 63}{space 4}  22.3701{col 76}{space 3} 226.8598
{txt}{space 15}dummy4 {c |}{col 23}{res}{space 2} 64.02452{col 35}{space 2} 37.84688{col 46}{space 1}    7.04{col 55}{space 3}0.000{col 63}{space 4} 20.09901{col 76}{space 3} 203.9473
{txt}{space 15}dummy5 {c |}{col 23}{res}{space 2} 56.26412{col 35}{space 2} 33.26906{col 46}{space 1}    6.82{col 55}{space 3}0.000{col 63}{space 4} 17.65691{col 76}{space 3} 179.2868
{txt}{space 15}dummy6 {c |}{col 23}{res}{space 2} 47.09162{col 35}{space 2} 27.85787{col 46}{space 1}    6.51{col 55}{space 3}0.000{col 63}{space 4} 14.77068{col 76}{space 3} 150.1367
{txt}{space 15}dummy7 {c |}{col 23}{res}{space 2}  37.8463{col 35}{space 2} 22.40381{col 46}{space 1}    6.14{col 55}{space 3}0.000{col 63}{space 4} 11.86148{col 76}{space 3} 120.7557
{txt}{space 15}dummy8 {c |}{col 23}{res}{space 2} 27.93713{col 35}{space 2} 16.55868{col 46}{space 1}    5.62{col 55}{space 3}0.000{col 63}{space 4} 8.743076{col 76}{space 3} 89.26873
{txt}{space 15}dummy9 {c |}{col 23}{res}{space 2} 16.66345{col 35}{space 2}  9.90652{col 46}{space 1}    4.73{col 55}{space 3}0.000{col 63}{space 4} 5.196616{col 76}{space 3} 53.43296
{txt}{space 14}dummy10 {c |}{col 23}{res}{space 2} 8.108983{col 35}{space 2} 4.883655{col 46}{space 1}    3.48{col 55}{space 3}0.001{col 63}{space 4} 2.490738{col 76}{space 3} 26.40004
{txt}{space 18}AGE {c |}{col 23}{res}{space 2} 1.144961{col 35}{space 2} .0027902{col 46}{space 1}   55.55{col 55}{space 3}0.000{col 63}{space 4} 1.139505{col 76}{space 3} 1.150443
{txt}{space 18}SEX {c |}{col 23}{res}{space 2} .8388531{col 35}{space 2} .0336828{col 46}{space 1}   -4.38{col 55}{space 3}0.000{col 63}{space 4} .7753668{col 76}{space 3} .9075375
{txt}{space 18}NHB {c |}{col 23}{res}{space 2}  1.31121{col 35}{space 2} .0669299{col 46}{space 1}    5.31{col 55}{space 3}0.000{col 63}{space 4} 1.186378{col 76}{space 3} 1.449176
{txt}{space 17}HISP {c |}{col 23}{res}{space 2} .7279748{col 35}{space 2} .0315365{col 46}{space 1}   -7.33{col 55}{space 3}0.000{col 63}{space 4} .6687157{col 76}{space 3} .7924853
{txt}{space 16}OTHER {c |}{col 23}{res}{space 2}  .656495{col 35}{space 2} .0713537{col 46}{space 1}   -3.87{col 55}{space 3}0.000{col 63}{space 4} .5305366{col 76}{space 3} .8123582
{txt}{space 7}zHorvathAgeEAA {c |}{col 23}{res}{space 2} .8987022{col 35}{space 2} .0258623{col 46}{space 1}   -3.71{col 55}{space 3}0.000{col 63}{space 4}  .849416{col 76}{space 3} .9508482
{txt}{space 8}zHannumAgeEAA {c |}{col 23}{res}{space 2} 1.118141{col 35}{space 2} .0324815{col 46}{space 1}    3.84{col 55}{space 3}0.000{col 63}{space 4} 1.056257{col 76}{space 3} 1.183651
{txt}{space 9}zPhenoAgeEAA {c |}{col 23}{res}{space 2} 1.194709{col 35}{space 2} .0347299{col 46}{space 1}    6.12{col 55}{space 3}0.000{col 63}{space 4} 1.128542{col 76}{space 3} 1.264755
{txt}{space 6}zGrimAgeMortEAA {c |}{col 23}{res}{space 2} 1.365905{col 35}{space 2} .0399691{col 46}{space 1}   10.66{col 55}{space 3}0.000{col 63}{space 4} 1.289771{col 76}{space 3} 1.446533
{txt}{space 9}zDunedinPoAm {c |}{col 23}{res}{space 2} 1.145443{col 35}{space 2} .0309815{col 46}{space 1}    5.02{col 55}{space 3}0.000{col 63}{space 4} 1.086302{col 76}{space 3} 1.207804
{txt}ztelomean_no_outliers {c |}{col 23}{res}{space 2} .8219669{col 35}{space 2} .0191118{col 46}{space 1}   -8.43{col 55}{space 3}0.000{col 63}{space 4} .7853491{col 76}{space 3} .8602921
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 2.25e-06{col 35}{space 2} 1.38e-06{col 46}{space 1}  -21.25{col 55}{space 3}0.000{col 63}{space 4} 6.77e-07{col 76}{space 3} 7.46e-06
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. 
. sort seqn 
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN_DISCRETE",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN_DISCRETE.dta{rm}
saved
{p_end}

{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN_DISCRETE",clear
{txt}
{com}. 
. capture rename _d d_var
{txt}
{com}. 
. keep AGE SEX NHB HISP OTHER d_var dummy* zHorvathAgeEAA-ztelomean_no_outliers
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN_DISCRETEfin",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET_ABN_DISCRETEfin.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}