{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET",clear
{txt}
{com}. 
. 
. //STEP 11: KAPLAN MEIER SURVIVAL CURVES BY TERTILES OF EACH EPIGENETIC CLOCK, EPIGENETIC EAA AND TL VARIABLES//
. 
. capture drop zHorvathAgeEAAtert zHannumAgeEAAtert zPhenoAgeEAAtert zGrimAgeMortEAAtert zDunedinPoAmtert ztelomean_no_outlierstert  
{txt}
{com}. 
. foreach var of varlist zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm ztelomean_no_outliers {c -(}
{txt}  2{com}.         xtile `var'tert=`var' if sample_final==1,nq(3)
{txt}  3{com}. 
. {c )-}
{txt}
{com}. 
. 
. tab1 *tert 

{res}-> tabulation of zHorvathAgeEAAtert  

{txt}3 quantiles {c |}
         of {c |}
zHorvathAge {c |}
       EAA  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        841       33.35       33.35
{txt}          2 {c |}{res}        841       33.35       66.69
{txt}          3 {c |}{res}        840       33.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00

-> tabulation of zHannumAgeEAAtert  

{txt}3 quantiles {c |}
         of {c |}
zHannumAgeE {c |}
        AA  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        841       33.35       33.35
{txt}          2 {c |}{res}        841       33.35       66.69
{txt}          3 {c |}{res}        840       33.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00

-> tabulation of zPhenoAgeEAAtert  

{txt}3 quantiles {c |}
         of {c |}
zPhenoAgeEA {c |}
         A  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        841       33.35       33.35
{txt}          2 {c |}{res}        841       33.35       66.69
{txt}          3 {c |}{res}        840       33.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00

-> tabulation of zGrimAgeMortEAAtert  

{txt}3 quantiles {c |}
         of {c |}
zGrimAgeMor {c |}
      tEAA  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        841       33.35       33.35
{txt}          2 {c |}{res}        841       33.35       66.69
{txt}          3 {c |}{res}        840       33.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00

-> tabulation of zDunedinPoAmtert  

{txt}3 quantiles {c |}
         of {c |}
zDunedinPoA {c |}
         m  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        841       33.35       33.35
{txt}          2 {c |}{res}        841       33.35       66.69
{txt}          3 {c |}{res}        840       33.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00

-> tabulation of ztelomean_no_outlierstert  

{txt}3 quantiles {c |}
         of {c |}
ztelomean_n {c |}
o_outliers  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        841       33.35       33.35
{txt}          2 {c |}{res}        841       33.35       66.69
{txt}          3 {c |}{res}        840       33.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,522      100.00
{txt}
{com}. 
. 
. foreach var of varlist *tert {c -(}
{txt}  2{com}.         sts test `var'
{txt}  3{com}. {c )-}
{txt}note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}Equality of survivor functions
Cox regression-based test

{col 13} {c |}  Observed       Expected     Relative
zHorvathAg~t {c |}    events         events       hazard
{hline 13}{c +}{hline 38}
           1 {c |}{res}  1.04e+07       1.21e+07       0.8715
           {txt}2 {c |}{res}  1.14e+07       1.21e+07       0.9535
           {txt}3 {c |}{res}  1.40e+07       1.17e+07       1.2108
{txt}{hline 13}{c +}{hline 38}
       Total {c |}{res}  3.59e+07       3.59e+07       1.0000

                               {txt}Wald chi2(2) =  {res}12.27
                               {txt}Pr>chi2      = {res}0.0022

{txt}{p 0 6 2 55}Note: Reporting Wald model test from Cox regression on {bf:zHorvathAgeEAAtert}.{p_end}
note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}Equality of survivor functions
Cox regression-based test

{col 13} {c |}  Observed       Expected     Relative
zHannumAge~t {c |}    events         events       hazard
{hline 13}{c +}{hline 38}
           1 {c |}{res}  1.04e+07       1.42e+07       0.7589
           {txt}2 {c |}{res}  1.14e+07       1.18e+07       1.0029
           {txt}3 {c |}{res}  1.40e+07     9827924.52       1.4842
{txt}{hline 13}{c +}{hline 38}
       Total {c |}{res}  3.59e+07       3.59e+07       1.0000

                               {txt}Wald chi2(2) =  {res}47.95
                               {txt}Pr>chi2      = {res}0.0000

{txt}{p 0 6 2 55}Note: Reporting Wald model test from Cox regression on {bf:zHannumAgeEAAtert}.{p_end}
note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}Equality of survivor functions
Cox regression-based test

{col 13} {c |}  Observed       Expected     Relative
zPhenoAgeE~t {c |}    events         events       hazard
{hline 13}{c +}{hline 38}
           1 {c |}{res}  1.04e+07       1.32e+07       0.8097
           {txt}2 {c |}{res}  1.16e+07       1.25e+07       0.9469
           {txt}3 {c |}{res}  1.39e+07       1.01e+07       1.4117
{txt}{hline 13}{c +}{hline 38}
       Total {c |}{res}  3.59e+07       3.59e+07       1.0000

                               {txt}Wald chi2(2) =  {res}35.34
                               {txt}Pr>chi2      = {res}0.0000

{txt}{p 0 6 2 55}Note: Reporting Wald model test from Cox regression on {bf:zPhenoAgeEAAtert}.{p_end}
note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}Equality of survivor functions
Cox regression-based test

{col 13} {c |}  Observed       Expected     Relative
zGrimAgeMo~t {c |}    events         events       hazard
{hline 13}{c +}{hline 38}
           1 {c |}{res}  1.03e+07       1.55e+07       0.7006
           {txt}2 {c |}{res}  1.14e+07       1.07e+07       1.1286
           {txt}3 {c |}{res}  1.42e+07     9733134.14       1.5410
{txt}{hline 13}{c +}{hline 38}
       Total {c |}{res}  3.59e+07       3.59e+07       1.0000

                               {txt}Wald chi2(2) =  {res}62.42
                               {txt}Pr>chi2      = {res}0.0000

{txt}{p 0 6 2 55}Note: Reporting Wald model test from Cox regression on {bf:zGrimAgeMortEAAtert}.{p_end}
note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}Equality of survivor functions
Cox regression-based test

{col 13} {c |}  Observed       Expected     Relative
zDunedinPo~t {c |}    events         events       hazard
{hline 13}{c +}{hline 38}
           1 {c |}{res}  1.01e+07       1.45e+07       0.7353
           {txt}2 {c |}{res}  1.08e+07       1.18e+07       0.9725
           {txt}3 {c |}{res}  1.49e+07     9616100.02       1.6440
{txt}{hline 13}{c +}{hline 38}
       Total {c |}{res}  3.59e+07       3.59e+07       1.0000

                               {txt}Wald chi2(2) =  {res}71.72
                               {txt}Pr>chi2      = {res}0.0000

{txt}{p 0 6 2 55}Note: Reporting Wald model test from Cox regression on {bf:zDunedinPoAmtert}.{p_end}
note: sampling weights detected; using Cox regression-based test.

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}Equality of survivor functions
Cox regression-based test

{col 13} {c |}  Observed       Expected     Relative
ztelomean_~t {c |}    events         events       hazard
{hline 13}{c +}{hline 38}
           1 {c |}{res}  1.39e+07     9916378.42       1.4738
           {txt}2 {c |}{res}  1.26e+07       1.19e+07       1.1039
           {txt}3 {c |}{res}9376074.85       1.40e+07       0.6991
{txt}{hline 13}{c +}{hline 38}
       Total {c |}{res}  3.59e+07       3.59e+07       1.0000

                               {txt}Wald chi2(2) =  {res}55.35
                               {txt}Pr>chi2      = {res}0.0000

{txt}{p 0 6 2 55}Note: Reporting Wald model test from Cox regression on {bf:ztelomean_no_outlierstert}.{p_end}

{com}. 
. 
. foreach var of varlist *tert {c -(}
{txt}  2{com}.         sts graph, by(`var')
{txt}  3{com}. graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1`var'.gph",replace
{txt}  4{com}. {c )-} 

{col 9}{txt}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zHorvathAgeEAAtert.gph} saved

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zHannumAgeEAAtert.gph} saved

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zPhenoAgeEAAtert.gph} saved

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zGrimAgeMortEAAtert.gph} saved

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zDunedinPoAmtert.gph} saved

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]
{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1ztelomean_no_outlierstert.gph} saved

{com}. 
. graph combine "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zHorvathAgeEAAtert.gph" ///
> "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zDunedinPoAmtert.gph" ////
> "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zGrimAgeMortEAAtert.gph"  ///
> "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zHannumAgeEAAtert.gph"  ///
> "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1zPhenoAgeEAAtert.gph"  ///
> "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1ztelomean_no_outlierstert.gph" ///
> 
{res}{txt}
{com}. graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1combined.gph",replace
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FIGURES\NHANES_FIGURE1_KM\FIGURE1combined.gph} saved

{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET.dta{rm}
saved
{p_end}

{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET",clear
{txt}
{com}. 
. 
. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}