{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. //STEP 15: HEATMAP FOR EACH TELOMERE LENGTH, EPIGENETIC CLOCKS VS. MORTALITY RISK, ADJUSTING AGE, SEX AND RACE: COX MODEL///
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET",clear
{txt}
{com}. 
. stset TIMEyears [pweight=WTDN4YR] , id(seqn) failure(DIED==1)

{txt}Survival-time data settings

{col 12}ID variable: {res}seqn
{col 10}{txt}Failure event: {res}DIED==1
{col 1}{txt}Observed time interval: {res}(TIMEyears[_n-1], TIMEyears]
{col 6}{txt}Exit on or before: {res}failure
{col 17}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}{hline 74}
{res}     21,004{txt}  total observations
{res}     10,445{txt}  event time missing (TIMEyears>=.){col 61}PROBABLE ERROR
{res}          1{txt}  observation ends on or before {bf:enter()}
{res}      8,026{txt}  weights invalid {col 61}PROBABLE ERROR
{hline 74}
{res}      2,532{txt}  observations remaining, representing
{res}      2,532{txt}  subjects
{res}      1,361{txt}  failures in single-failure-per-subject data
{res} 35,399.583{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res}        0
                                          {txt}Last observed exit t = {res}    20.75
{txt}
{com}. 
. 
. * Install estout if not already installed
. ssc install estout, replace
{txt}checking {hilite:estout} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. 
. * Clear any previous estimates
. est clear
{res}{txt}
{com}. 
. * Start the loop
. foreach x of varlist zHorvathAgeEAA zHannumAgeEAA zPhenoAgeEAA zGrimAgeMortEAA zDunedinPoAm ztelomean_no_outliers  ztelostd_no_outliers  {c -(} 
{txt}  2{com}.     
.         * Run the stcox command
.         stcox `x' AGE SEX i.RACE if sample_final==1
{txt}  3{com}.         
.         * Store the estimates
.         eststo output`x'
{txt}  4{com}.     {c )-}

{col 9}{txt}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}(sum of wgt is 75,892,564.642227)
Iteration 0:  Log pseudolikelihood = {res}-6.387e+08
{txt}Iteration 1:  Log pseudolikelihood = {res}-6.214e+08
{txt}Iteration 2:  Log pseudolikelihood = {res}-6.211e+08
{txt}Iteration 3:  Log pseudolikelihood = {res}-6.211e+08
{txt}Iteration 4:  Log pseudolikelihood = {res}-6.211e+08
{txt}Refining estimates:
Iteration 0:  Log pseudolikelihood = {res}-6.211e+08

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 10:75,892,565}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:2,522}
{txt}No. of failures = {res}{ralign 10:35,865,178}
{txt}Time at risk    = {res}{ralign 10:1109661913}
{col 57}{txt}{lalign 13:Wald chi2({res:6})} = {res}{ralign 6:631.01}
{txt}Log pseudolikelihood = {res}-6.211e+08{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{ralign 80:(Std. err. adjusted for {res:2,522} clusters in {res:seqn})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}            _t{col 16}{c |} Haz. ratio{col 28}   std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
zHorvathAgeEAA {c |}{col 16}{res}{space 2} 1.145291{col 28}{space 2} .0405622{col 39}{space 1}    3.83{col 48}{space 3}0.000{col 56}{space 4} 1.068487{col 69}{space 3} 1.227616
{txt}{space 11}AGE {c |}{col 16}{res}{space 2} 1.109915{col 28}{space 2} .0047571{col 39}{space 1}   24.33{col 48}{space 3}0.000{col 56}{space 4}  1.10063{col 69}{space 3} 1.119278
{txt}{space 11}SEX {c |}{col 16}{res}{space 2} .6872618{col 28}{space 2} .0512704{col 39}{space 1}   -5.03{col 48}{space 3}0.000{col 56}{space 4} .5937749{col 69}{space 3} .7954678
{txt}{space 14} {c |}
{space 10}RACE {c |}
{space 12}1  {c |}{col 16}{res}{space 2} 1.363712{col 28}{space 2} .1101984{col 39}{space 1}    3.84{col 48}{space 3}0.000{col 56}{space 4} 1.163963{col 69}{space 3} 1.597741
{txt}{space 12}2  {c |}{col 16}{res}{space 2} .9679612{col 28}{space 2} .0975758{col 39}{space 1}   -0.32{col 48}{space 3}0.747{col 56}{space 4} .7944237{col 69}{space 3} 1.179407
{txt}{space 12}3  {c |}{col 16}{res}{space 2} .8183581{col 28}{space 2} .1647276{col 39}{space 1}   -1.00{col 48}{space 3}0.319{col 56}{space 4} .5515751{col 69}{space 3} 1.214177
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}(sum of wgt is 75,892,564.642227)
Iteration 0:  Log pseudolikelihood = {res}-6.387e+08
{txt}Iteration 1:  Log pseudolikelihood = {res}-6.210e+08
{txt}Iteration 2:  Log pseudolikelihood = {res}-6.207e+08
{txt}Iteration 3:  Log pseudolikelihood = {res}-6.207e+08
{txt}Iteration 4:  Log pseudolikelihood = {res}-6.207e+08
{txt}Refining estimates:
Iteration 0:  Log pseudolikelihood = {res}-6.207e+08

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 10:75,892,565}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:2,522}
{txt}No. of failures = {res}{ralign 10:35,865,178}
{txt}Time at risk    = {res}{ralign 10:1109661913}
{col 57}{txt}{lalign 13:Wald chi2({res:6})} = {res}{ralign 6:647.91}
{txt}Log pseudolikelihood = {res}-6.207e+08{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{ralign 79:(Std. err. adjusted for {res:2,522} clusters in {res:seqn})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}           _t{col 15}{c |} Haz. ratio{col 27}   std. err.{col 39}      z{col 47}   P>|z|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
zHannumAgeEAA {c |}{col 15}{res}{space 2} 1.237773{col 27}{space 2} .0440698{col 38}{space 1}    5.99{col 47}{space 3}0.000{col 55}{space 4} 1.154343{col 68}{space 3} 1.327233
{txt}{space 10}AGE {c |}{col 15}{res}{space 2} 1.109954{col 27}{space 2} .0047989{col 38}{space 1}   24.13{col 47}{space 3}0.000{col 55}{space 4} 1.100588{col 68}{space 3}   1.1194
{txt}{space 10}SEX {c |}{col 15}{res}{space 2} .7187468{col 27}{space 2} .0540418{col 38}{space 1}   -4.39{col 47}{space 3}0.000{col 55}{space 4} .6202617{col 68}{space 3} .8328694
{txt}{space 13} {c |}
{space 9}RACE {c |}
{space 11}1  {c |}{col 15}{res}{space 2}  1.44955{col 27}{space 2} .1196659{col 38}{space 1}    4.50{col 47}{space 3}0.000{col 55}{space 4} 1.233001{col 68}{space 3} 1.704132
{txt}{space 11}2  {c |}{col 15}{res}{space 2} .9265047{col 27}{space 2} .0931895{col 38}{space 1}   -0.76{col 47}{space 3}0.448{col 55}{space 4} .7607329{col 68}{space 3}   1.1284
{txt}{space 11}3  {c |}{col 15}{res}{space 2} .7862845{col 27}{space 2} .1560846{col 38}{space 1}   -1.21{col 47}{space 3}0.226{col 55}{space 4} .5328543{col 68}{space 3} 1.160248
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}(sum of wgt is 75,892,564.642227)
Iteration 0:  Log pseudolikelihood = {res}-6.387e+08
{txt}Iteration 1:  Log pseudolikelihood = {res}-6.206e+08
{txt}Iteration 2:  Log pseudolikelihood = {res}-6.203e+08
{txt}Iteration 3:  Log pseudolikelihood = {res}-6.203e+08
{txt}Iteration 4:  Log pseudolikelihood = {res}-6.203e+08
{txt}Refining estimates:
Iteration 0:  Log pseudolikelihood = {res}-6.203e+08

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 10:75,892,565}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:2,522}
{txt}No. of failures = {res}{ralign 10:35,865,178}
{txt}Time at risk    = {res}{ralign 10:1109661913}
{col 57}{txt}{lalign 13:Wald chi2({res:6})} = {res}{ralign 6:673.00}
{txt}Log pseudolikelihood = {res}-6.203e+08{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{ralign 78:(Std. err. adjusted for {res:2,522} clusters in {res:seqn})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          _t{col 14}{c |} Haz. ratio{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
zPhenoAgeEAA {c |}{col 14}{res}{space 2} 1.319364{col 26}{space 2} .0524157{col 37}{space 1}    6.98{col 46}{space 3}0.000{col 54}{space 4} 1.220529{col 67}{space 3} 1.426203
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} 1.110189{col 26}{space 2} .0047475{col 37}{space 1}   24.44{col 46}{space 3}0.000{col 54}{space 4} 1.100923{col 67}{space 3} 1.119533
{txt}{space 9}SEX {c |}{col 14}{res}{space 2} .6848993{col 26}{space 2} .0504045{col 37}{space 1}   -5.14{col 46}{space 3}0.000{col 54}{space 4} .5929026{col 67}{space 3} .7911705
{txt}{space 12} {c |}
{space 8}RACE {c |}
{space 10}1  {c |}{col 14}{res}{space 2} 1.373214{col 26}{space 2} .1120889{col 37}{space 1}    3.89{col 46}{space 3}0.000{col 54}{space 4} 1.170196{col 67}{space 3} 1.611453
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .9339284{col 26}{space 2} .0952352{col 37}{space 1}   -0.67{col 46}{space 3}0.503{col 54}{space 4} .7647408{col 67}{space 3} 1.140546
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .8102601{col 26}{space 2} .1632474{col 37}{space 1}   -1.04{col 46}{space 3}0.296{col 54}{space 4} .5459192{col 67}{space 3} 1.202598
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}(sum of wgt is 75,892,564.642227)
Iteration 0:  Log pseudolikelihood = {res}-6.387e+08
{txt}Iteration 1:  Log pseudolikelihood = {res}-6.182e+08
{txt}Iteration 2:  Log pseudolikelihood = {res}-6.180e+08
{txt}Iteration 3:  Log pseudolikelihood = {res}-6.180e+08
{txt}Iteration 4:  Log pseudolikelihood = {res}-6.180e+08
{txt}Refining estimates:
Iteration 0:  Log pseudolikelihood = {res}-6.180e+08

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 10:75,892,565}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:2,522}
{txt}No. of failures = {res}{ralign 10:35,865,178}
{txt}Time at risk    = {res}{ralign 10:1109661913}
{col 57}{txt}{lalign 13:Wald chi2({res:6})} = {res}{ralign 6:682.42}
{txt}Log pseudolikelihood = {res}-6.180e+08{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{ralign 81:(Std. err. adjusted for {res:2,522} clusters in {res:seqn})}
{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 17}{c |}{col 29}    Robust
{col 1}             _t{col 17}{c |} Haz. ratio{col 29}   std. err.{col 41}      z{col 49}   P>|z|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
zGrimAgeMortEAA {c |}{col 17}{res}{space 2} 1.609214{col 29}{space 2} .0632711{col 40}{space 1}   12.10{col 49}{space 3}0.000{col 57}{space 4} 1.489863{col 70}{space 3} 1.738126
{txt}{space 12}AGE {c |}{col 17}{res}{space 2}  1.11606{col 29}{space 2} .0049579{col 40}{space 1}   24.72{col 49}{space 3}0.000{col 57}{space 4} 1.106385{col 70}{space 3}  1.12582
{txt}{space 12}SEX {c |}{col 17}{res}{space 2}  .884474{col 29}{space 2} .0686639{col 40}{space 1}   -1.58{col 49}{space 3}0.114{col 57}{space 4} .7596336{col 70}{space 3} 1.029831
{txt}{space 15} {c |}
{space 11}RACE {c |}
{space 13}1  {c |}{col 17}{res}{space 2} 1.215888{col 29}{space 2}  .098292{col 40}{space 1}    2.42{col 49}{space 3}0.016{col 57}{space 4} 1.037726{col 70}{space 3} 1.424638
{txt}{space 13}2  {c |}{col 17}{res}{space 2} .9425088{col 29}{space 2} .0973554{col 40}{space 1}   -0.57{col 49}{space 3}0.566{col 57}{space 4} .7697709{col 70}{space 3} 1.154009
{txt}{space 13}3  {c |}{col 17}{res}{space 2} .8696961{col 29}{space 2} .1780471{col 40}{space 1}   -0.68{col 49}{space 3}0.495{col 57}{space 4} .5822461{col 70}{space 3} 1.299058
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}(sum of wgt is 75,892,564.642227)
Iteration 0:  Log pseudolikelihood = {res}-6.387e+08
{txt}Iteration 1:  Log pseudolikelihood = {res}-6.198e+08
{txt}Iteration 2:  Log pseudolikelihood = {res}-6.195e+08
{txt}Iteration 3:  Log pseudolikelihood = {res}-6.195e+08
{txt}Iteration 4:  Log pseudolikelihood = {res}-6.195e+08
{txt}Refining estimates:
Iteration 0:  Log pseudolikelihood = {res}-6.195e+08

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 10:75,892,565}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:2,522}
{txt}No. of failures = {res}{ralign 10:35,865,178}
{txt}Time at risk    = {res}{ralign 10:1109661913}
{col 57}{txt}{lalign 13:Wald chi2({res:6})} = {res}{ralign 6:632.88}
{txt}Log pseudolikelihood = {res}-6.195e+08{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{ralign 78:(Std. err. adjusted for {res:2,522} clusters in {res:seqn})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          _t{col 14}{c |} Haz. ratio{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
zDunedinPoAm {c |}{col 14}{res}{space 2} 1.386898{col 26}{space 2} .0517681{col 37}{space 1}    8.76{col 46}{space 3}0.000{col 54}{space 4} 1.289057{col 67}{space 3} 1.492165
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} 1.109962{col 26}{space 2} .0048637{col 37}{space 1}   23.81{col 46}{space 3}0.000{col 54}{space 4}  1.10047{col 67}{space 3} 1.119536
{txt}{space 9}SEX {c |}{col 14}{res}{space 2} .7062887{col 26}{space 2} .0527834{col 37}{space 1}   -4.65{col 46}{space 3}0.000{col 54}{space 4}  .610055{col 67}{space 3} .8177028
{txt}{space 12} {c |}
{space 8}RACE {c |}
{space 10}1  {c |}{col 14}{res}{space 2} 1.255157{col 26}{space 2} .1006765{col 37}{space 1}    2.83{col 46}{space 3}0.005{col 54}{space 4} 1.072563{col 67}{space 3} 1.468836
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .9102149{col 26}{space 2} .0943634{col 37}{space 1}   -0.91{col 46}{space 3}0.364{col 54}{space 4} .7428456{col 67}{space 3} 1.115294
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .8027055{col 26}{space 2} .1598905{col 37}{space 1}   -1.10{col 46}{space 3}0.270{col 54}{space 4} .5432576{col 67}{space 3}  1.18606
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}(sum of wgt is 75,892,564.642227)
Iteration 0:  Log pseudolikelihood = {res}-6.387e+08
{txt}Iteration 1:  Log pseudolikelihood = {res}-6.215e+08
{txt}Iteration 2:  Log pseudolikelihood = {res}-6.212e+08
{txt}Iteration 3:  Log pseudolikelihood = {res}-6.212e+08
{txt}Iteration 4:  Log pseudolikelihood = {res}-6.212e+08
{txt}Refining estimates:
Iteration 0:  Log pseudolikelihood = {res}-6.212e+08

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 10:75,892,565}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:2,522}
{txt}No. of failures = {res}{ralign 10:35,865,178}
{txt}Time at risk    = {res}{ralign 10:1109661913}
{col 57}{txt}{lalign 13:Wald chi2({res:6})} = {res}{ralign 6:617.80}
{txt}Log pseudolikelihood = {res}-6.212e+08{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{ralign 87:(Std. err. adjusted for {res:2,522} clusters in {res:seqn})}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                   _t{col 23}{c |} Haz. ratio{col 35}   std. err.{col 47}      z{col 55}   P>|z|{col 63}     [95% con{col 76}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
ztelomean_no_outliers {c |}{col 23}{res}{space 2} .8682019{col 35}{space 2} .0442545{col 46}{space 1}   -2.77{col 55}{space 3}0.006{col 63}{space 4} .7856566{col 76}{space 3} .9594199
{txt}{space 18}AGE {c |}{col 23}{res}{space 2} 1.106459{col 35}{space 2} .0048119{col 46}{space 1}   23.26{col 55}{space 3}0.000{col 63}{space 4} 1.097068{col 76}{space 3} 1.115931
{txt}{space 18}SEX {c |}{col 23}{res}{space 2} .6874003{col 35}{space 2} .0515224{col 46}{space 1}   -5.00{col 55}{space 3}0.000{col 63}{space 4} .5934854{col 76}{space 3} .7961766
{txt}{space 21} {c |}
{space 17}RACE {c |}
{space 19}1  {c |}{col 23}{res}{space 2} 1.357509{col 35}{space 2} .1094506{col 46}{space 1}    3.79{col 55}{space 3}0.000{col 63}{space 4} 1.159081{col 76}{space 3} 1.589907
{txt}{space 19}2  {c |}{col 23}{res}{space 2} .9392326{col 35}{space 2}  .094129{col 46}{space 1}   -0.63{col 55}{space 3}0.532{col 63}{space 4} .7717321{col 76}{space 3} 1.143088
{txt}{space 19}3  {c |}{col 23}{res}{space 2} .8017043{col 35}{space 2} .1601506{col 46}{space 1}   -1.11{col 55}{space 3}0.269{col 63}{space 4} .5419708{col 76}{space 3} 1.185912
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{col 9}Failure {bf:_d}: {res}DIED==1
{col 3}{txt}Analysis time {bf:_t}: {res}TIMEyears
{col 8}{txt}ID variable: {res}seqn
{col 13}{txt}Weight: {res}[pweight=WTDN4YR]

{txt}(sum of wgt is 75,892,564.642227)
Iteration 0:  Log pseudolikelihood = {res}-6.387e+08
{txt}Iteration 1:  Log pseudolikelihood = {res}-6.217e+08
{txt}Iteration 2:  Log pseudolikelihood = {res}-6.214e+08
{txt}Iteration 3:  Log pseudolikelihood = {res}-6.214e+08
{txt}Iteration 4:  Log pseudolikelihood = {res}-6.214e+08
{txt}Refining estimates:
Iteration 0:  Log pseudolikelihood = {res}-6.214e+08

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 10:75,892,565}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:2,522}
{txt}No. of failures = {res}{ralign 10:35,865,178}
{txt}Time at risk    = {res}{ralign 10:1109661913}
{col 57}{txt}{lalign 13:Wald chi2({res:6})} = {res}{ralign 6:622.92}
{txt}Log pseudolikelihood = {res}-6.214e+08{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{ralign 86:(Std. err. adjusted for {res:2,522} clusters in {res:seqn})}
{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 22}{c |}{col 34}    Robust
{col 1}                  _t{col 22}{c |} Haz. ratio{col 34}   std. err.{col 46}      z{col 54}   P>|z|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
ztelostd_no_outliers {c |}{col 22}{res}{space 2} .9671069{col 34}{space 2} .0391523{col 45}{space 1}   -0.83{col 54}{space 3}0.409{col 62}{space 4} .8933353{col 75}{space 3}  1.04697
{txt}{space 17}AGE {c |}{col 22}{res}{space 2} 1.109295{col 34}{space 2} .0047815{col 45}{space 1}   24.06{col 54}{space 3}0.000{col 62}{space 4} 1.099963{col 75}{space 3} 1.118706
{txt}{space 17}SEX {c |}{col 22}{res}{space 2} .6735172{col 34}{space 2} .0497507{col 45}{space 1}   -5.35{col 54}{space 3}0.000{col 62}{space 4} .5827375{col 75}{space 3} .7784387
{txt}{space 20} {c |}
{space 16}RACE {c |}
{space 18}1  {c |}{col 22}{res}{space 2} 1.333984{col 34}{space 2} .1072606{col 45}{space 1}    3.58{col 54}{space 3}0.000{col 62}{space 4} 1.139485{col 75}{space 3} 1.561682
{txt}{space 18}2  {c |}{col 22}{res}{space 2} .9372783{col 34}{space 2}  .094888{col 45}{space 1}   -0.64{col 54}{space 3}0.522{col 62}{space 4}   .76859{col 75}{space 3}  1.14299
{txt}{space 18}3  {c |}{col 22}{res}{space 2} .8110148{col 34}{space 2}  .163119{col 45}{space 1}   -1.04{col 54}{space 3}0.298{col 62}{space 4} .5467981{col 75}{space 3} 1.202903
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. 
. 
. * Export the results to a dataset
. esttab using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\results_TABLE5.csv", replace se ar2
{res}{txt}(output written to {browse  `"E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\results_TABLE5.csv"'})

{com}. 
. import delimited "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\results_TABLE5.csv", clear
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(8 vars, 32 obs)

{com}. 
. 
. * Convert the CSV file to a Stata dataset (if needed)
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\results_TABLE5.dta",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\results_TABLE5.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. **Fix the dataset so it is simpler. This is saved as : cleaned_results_TABLE5_final.csv in the same folder**
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET",clear
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2025\HRS_NHANES_HANDLS_TLEPIGENMORT\FINAL_DATA\NHANES\NHANES_MERGED_DATASET.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}